nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
<?xml version="1.0" encoding="UTF-8" ?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.0" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1.0.xsd">
    <name>esp32</name>
    <version>1.0</version>
    <width>32</width>
    <cpu>
        <name>Xtensa LX6</name>
        <revision>1</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <nvicPrioBits>3</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <peripherals>
        <peripheral>
            <name>AES</name>
            <baseAddress>0x3ff01000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>HINF</name>
            <baseAddress>0x3ff4b000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x000001a0</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>HINF_CFG_DATA0</name>
                    <addressOffset>0x0</addressOffset>
                    <description>HINF_CFG_DATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_DEVICE_ID_FN1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>HINF_USER_ID_FN1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CFG_DATA1</name>
                    <addressOffset>0x4</addressOffset>
                    <description>HINF_CFG_DATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_SDIO20_CONF1</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>HINF_FUNC2_EPS</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO_VER</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO20_CONF0</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HINF_IOENABLE1</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_EMP</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_FUNC1_EPS</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_CD_DISABLE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_IOENABLE2</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO_INT_MASK</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO_IOREADY2</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO_CD_ENABLE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_HIGHSPEED_MODE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_HIGHSPEED_ENABLE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO_IOREADY1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO_ENABLE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CFG_DATA7</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>HINF_CFG_DATA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_SDIO_IOREADY0</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_SDIO_RST</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HINF_CHIP_STATE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HINF_PIN_STATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF0</name>
                    <addressOffset>0x20</addressOffset>
                    <description>HINF_CIS_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF1</name>
                    <addressOffset>0x24</addressOffset>
                    <description>HINF_CIS_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF2</name>
                    <addressOffset>0x28</addressOffset>
                    <description>HINF_CIS_CONF2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF3</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>HINF_CIS_CONF3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF4</name>
                    <addressOffset>0x30</addressOffset>
                    <description>HINF_CIS_CONF4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF5</name>
                    <addressOffset>0x34</addressOffset>
                    <description>HINF_CIS_CONF5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF6</name>
                    <addressOffset>0x38</addressOffset>
                    <description>HINF_CIS_CONF6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CIS_CONF7</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>HINF_CIS_CONF7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_CIS_CONF_W7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_CFG_DATA16</name>
                    <addressOffset>0x40</addressOffset>
                    <description>HINF_CFG_DATA16</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_DEVICE_ID_FN2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>HINF_USER_ID_FN2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINF_DATE</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>HINF_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HINF_SDIO_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
