nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>SPI_PIN</name>
                    <addressOffset>0x34</addressOffset>
                    <description>SPI_PIN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_CS_KEEP_ACTIVE</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CK_IDLE_EDGE</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_MASTER_CK_SEL</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SPI_MASTER_CS_POL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CK_DIS</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CS2_DIS</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CS1_DIS</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CS0_DIS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE</name>
                    <addressOffset>0x38</addressOffset>
                    <description>SPI_SLAVE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SYNC_RESET</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLAVE_MODE</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WR_RD_BUF_EN</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WR_RD_STA_EN</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_CMD_DEFINE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_TRANS_CNT</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_LAST_STATE</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_LAST_COMMAND</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CS_I_MODE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SPI_INT_EN</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SPI_TRANS_DONE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WR_STA_DONE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RD_STA_DONE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WR_BUF_DONE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RD_BUF_DONE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE1</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>SPI_SLAVE1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SLV_STATUS_BITLEN</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_STATUS_FAST_EN</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_STATUS_READBACK</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RD_ADDR_BITLEN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WR_ADDR_BITLEN</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WRSTA_DUMMY_EN</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RDSTA_DUMMY_EN</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WRBUF_DUMMY_EN</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RDBUF_DUMMY_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE2</name>
                    <addressOffset>0x40</addressOffset>
                    <description>SPI_SLAVE2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SLV_WRBUF_DUMMY_CYCLELEN</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RDBUF_DUMMY_CYCLELEN</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WRSTA_DUMMY_CYCLELEN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RDSTA_DUMMY_CYCLELEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE3</name>
                    <addressOffset>0x44</addressOffset>
                    <description>SPI_SLAVE3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SLV_WRSTA_CMD_VALUE</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RDSTA_CMD_VALUE</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_WRBUF_CMD_VALUE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SLV_RDBUF_CMD_VALUE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLV_WRBUF_DLEN</name>
                    <addressOffset>0x48</addressOffset>
                    <description>SPI_SLV_WRBUF_DLEN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SLV_WRBUF_DBITLEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLV_RDBUF_DLEN</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>SPI_SLV_RDBUF_DLEN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SLV_RDBUF_DBITLEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_CACHE_FCTRL</name>
                    <addressOffset>0x50</addressOffset>
                    <description>SPI_CACHE_FCTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_CACHE_FLASH_PES_EN</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CACHE_FLASH_USR_CMD</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CACHE_USR_CMD_4BYTE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CACHE_REQ_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_CACHE_SCTRL</name>
                    <addressOffset>0x54</addressOffset>
                    <description>SPI_CACHE_SCTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_CACHE_SRAM_USR_WCMD</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SRAM_ADDR_BITLEN</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SRAM_DUMMY_CYCLELEN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SRAM_BYTES_LEN</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CACHE_SRAM_USR_RCMD</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_USR_RD_SRAM_DUMMY</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_USR_WR_SRAM_DUMMY</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_USR_SRAM_QIO</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_USR_SRAM_DIO</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SRAM_CMD</name>
                    <addressOffset>0x58</addressOffset>
                    <description>SPI_SRAM_CMD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SRAM_RSTIO</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SRAM_QIO</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_SRAM_DIO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SRAM_DRD_CMD</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>SPI_SRAM_DRD_CMD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_CACHE_SRAM_USR_RD_CMD_BITLEN</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CACHE_SRAM_USR_RD_CMD_VALUE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SRAM_DWR_CMD</name>
                    <addressOffset>0x60</addressOffset>
                    <description>SPI_SRAM_DWR_CMD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_CACHE_SRAM_USR_WR_CMD_BITLEN</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SPI_CACHE_SRAM_USR_WR_CMD_VALUE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLV_RD_BIT</name>
                    <addressOffset>0x64</addressOffset>
                    <description>SPI_SLV_RD_BIT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_SLV_RDATA_BIT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W0</name>
                    <addressOffset>0x80</addressOffset>
                    <description>SPI_W0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W1</name>
                    <addressOffset>0x84</addressOffset>
                    <description>SPI_W1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W2</name>
                    <addressOffset>0x88</addressOffset>
                    <description>SPI_W2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W3</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>SPI_W3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W4</name>
                    <addressOffset>0x90</addressOffset>
                    <description>SPI_W4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W5</name>
                    <addressOffset>0x94</addressOffset>
                    <description>SPI_W5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W6</name>
                    <addressOffset>0x98</addressOffset>
                    <description>SPI_W6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W7</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>SPI_W7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_BUF7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
