nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>SPI_DMA_INT_CLR</name>
                    <addressOffset>0x11c</addressOffset>
                    <description>SPI_DMA_INT_CLR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_OUT_TOTAL_EOF_INT_CLR</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_OUT_EOF_INT_CLR</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_OUT_DONE_INT_CLR</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_IN_SUC_EOF_INT_CLR</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_IN_ERR_EOF_INT_CLR</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_IN_DONE_INT_CLR</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_INLINK_DSCR_ERROR_INT_CLR</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_OUTLINK_DSCR_ERROR_INT_CLR</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI_INLINK_DSCR_EMPTY_INT_CLR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_IN_ERR_EOF_DES_ADDR</name>
                    <addressOffset>0x120</addressOffset>
                    <description>SPI_IN_ERR_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_IN_ERR_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_IN_SUC_EOF_DES_ADDR</name>
                    <addressOffset>0x124</addressOffset>
                    <description>SPI_IN_SUC_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_IN_SUC_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_INLINK_DSCR</name>
                    <addressOffset>0x128</addressOffset>
                    <description>SPI_INLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_INLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_INLINK_DSCR_BF0</name>
                    <addressOffset>0x12c</addressOffset>
                    <description>SPI_INLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_INLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_INLINK_DSCR_BF1</name>
                    <addressOffset>0x130</addressOffset>
                    <description>SPI_INLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_INLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_OUT_EOF_BFR_DES_ADDR</name>
                    <addressOffset>0x134</addressOffset>
                    <description>SPI_OUT_EOF_BFR_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_OUT_EOF_BFR_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_OUT_EOF_DES_ADDR</name>
                    <addressOffset>0x138</addressOffset>
                    <description>SPI_OUT_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_OUT_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_OUTLINK_DSCR</name>
                    <addressOffset>0x13c</addressOffset>
                    <description>SPI_OUTLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_OUTLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_OUTLINK_DSCR_BF0</name>
                    <addressOffset>0x140</addressOffset>
                    <description>SPI_OUTLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_OUTLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_OUTLINK_DSCR_BF1</name>
                    <addressOffset>0x144</addressOffset>
                    <description>SPI_OUTLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_OUTLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_DMA_RSTATUS</name>
                    <addressOffset>0x148</addressOffset>
                    <description>SPI_DMA_RSTATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_OUT_STATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_DMA_TSTATUS</name>
                    <addressOffset>0x14c</addressOffset>
                    <description>SPI_DMA_TSTATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DMA_IN_STATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_DATE</name>
                    <addressOffset>0x3fc</addressOffset>
                    <description>SPI_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
