nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EFUSE</name>
            <baseAddress>0x3ff5a000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000920</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EFUSE_BLK0_RDATA0</name>
                    <addressOffset>0x0</addressOffset>
                    <description>EFUSE_BLK0_RDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_RD_FLASH_CRYPT_CNT</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_EFUSE_RD_DIS</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_RDATA1</name>
                    <addressOffset>0x4</addressOffset>
                    <description>EFUSE_BLK0_RDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_RD_WIFI_MAC_CRC_LOW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_RDATA2</name>
                    <addressOffset>0x8</addressOffset>
                    <description>EFUSE_BLK0_RDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_RD_WIFI_MAC_CRC_HIGH</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_RDATA3</name>
                    <addressOffset>0xc</addressOffset>
                    <description>EFUSE_BLK0_RDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_RD_CHIP_VER_REV1</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CHIP_CPU_FREQ_RATED</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CHIP_CPU_FREQ_LOW</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CHIP_VER_PKG</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SPI_PAD_CONFIG_HD</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CHIP_VER_DIS_CACHE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CHIP_VER_32PAD</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CHIP_VER_DIS_BT</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CHIP_VER_DIS_APP_CPU</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_RDATA4</name>
                    <addressOffset>0x10</addressOffset>
                    <description>EFUSE_BLK0_RDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_RD_SDIO_FORCE</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SDIO_TIEH</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_XPD_SDIO_REG</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_ADC_VREF</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SDIO_DREFL</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SDIO_DREFM</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SDIO_DREFH</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CK8M_FREQ</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_RDATA5</name>
                    <addressOffset>0x14</addressOffset>
                    <description>EFUSE_BLK0_RDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_RD_FLASH_CRYPT_CONFIG</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_INST_CONFIG</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SPI_PAD_CONFIG_D</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SPI_PAD_CONFIG_Q</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_SPI_PAD_CONFIG_CLK</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_RDATA6</name>
                    <addressOffset>0x18</addressOffset>
                    <description>EFUSE_BLK0_RDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_RD_KEY_STATUS</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_DISABLE_DL_CACHE</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_DISABLE_DL_DECRYPT</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_DISABLE_DL_ENCRYPT</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_DISABLE_JTAG</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_ABS_DONE_1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_ABS_DONE_0</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_DISABLE_SDIO_HOST</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CONSOLE_DEBUG_DISABLE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_CODING_SCHEME</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_WDATA0</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>EFUSE_BLK0_WDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_FLASH_CRYPT_CNT</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_DIS</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_WR_DIS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_WDATA1</name>
                    <addressOffset>0x20</addressOffset>
                    <description>EFUSE_BLK0_WDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_WIFI_MAC_CRC_LOW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_WDATA2</name>
                    <addressOffset>0x24</addressOffset>
                    <description>EFUSE_BLK0_WDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_WIFI_MAC_CRC_HIGH</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_WDATA3</name>
                    <addressOffset>0x28</addressOffset>
                    <description>EFUSE_BLK0_WDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_CHIP_VER_REV1</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CHIP_CPU_FREQ_RATED</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CHIP_CPU_FREQ_LOW</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CHIP_VER_PKG</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SPI_PAD_CONFIG_HD</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CHIP_VER_DIS_CACHE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CHIP_VER_32PAD</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CHIP_VER_DIS_BT</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CHIP_VER_DIS_APP_CPU</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_WDATA4</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>EFUSE_BLK0_WDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_SDIO_FORCE</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SDIO_TIEH</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_XPD_SDIO_REG</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_ADC_VREF</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SDIO_DREFL</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SDIO_DREFM</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SDIO_DREFH</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CK8M_FREQ</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_WDATA5</name>
                    <addressOffset>0x30</addressOffset>
                    <description>EFUSE_BLK0_WDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_FLASH_CRYPT_CONFIG</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_INST_CONFIG</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SPI_PAD_CONFIG_D</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SPI_PAD_CONFIG_Q</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_SPI_PAD_CONFIG_CLK</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK0_WDATA6</name>
                    <addressOffset>0x34</addressOffset>
                    <description>EFUSE_BLK0_WDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_KEY_STATUS</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_DISABLE_DL_CACHE</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_DISABLE_DL_DECRYPT</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_DISABLE_DL_ENCRYPT</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_DISABLE_JTAG</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_ABS_DONE_1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_ABS_DONE_0</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_DISABLE_SDIO_HOST</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CONSOLE_DEBUG_DISABLE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CODING_SCHEME</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_RDATA0</name>
                    <addressOffset>0x38</addressOffset>
                    <description>EFUSE_BLK1_RDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_RDATA1</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>EFUSE_BLK1_RDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
