nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>EFUSE_BLK1_RDATA2</name>
                    <addressOffset>0x40</addressOffset>
                    <description>EFUSE_BLK1_RDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_RDATA3</name>
                    <addressOffset>0x44</addressOffset>
                    <description>EFUSE_BLK1_RDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_RDATA4</name>
                    <addressOffset>0x48</addressOffset>
                    <description>EFUSE_BLK1_RDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_RDATA5</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>EFUSE_BLK1_RDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_RDATA6</name>
                    <addressOffset>0x50</addressOffset>
                    <description>EFUSE_BLK1_RDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_RDATA7</name>
                    <addressOffset>0x54</addressOffset>
                    <description>EFUSE_BLK1_RDATA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DOUT7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA0</name>
                    <addressOffset>0x58</addressOffset>
                    <description>EFUSE_BLK2_RDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA1</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>EFUSE_BLK2_RDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA2</name>
                    <addressOffset>0x60</addressOffset>
                    <description>EFUSE_BLK2_RDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA3</name>
                    <addressOffset>0x64</addressOffset>
                    <description>EFUSE_BLK2_RDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA4</name>
                    <addressOffset>0x68</addressOffset>
                    <description>EFUSE_BLK2_RDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA5</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>EFUSE_BLK2_RDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA6</name>
                    <addressOffset>0x70</addressOffset>
                    <description>EFUSE_BLK2_RDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_RDATA7</name>
                    <addressOffset>0x74</addressOffset>
                    <description>EFUSE_BLK2_RDATA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DOUT7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA0</name>
                    <addressOffset>0x78</addressOffset>
                    <description>EFUSE_BLK3_RDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA1</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>EFUSE_BLK3_RDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA2</name>
                    <addressOffset>0x80</addressOffset>
                    <description>EFUSE_BLK3_RDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA3</name>
                    <addressOffset>0x84</addressOffset>
                    <description>EFUSE_BLK3_RDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_ADC2_TP_HIGH</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_ADC2_TP_LOW</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_ADC1_TP_HIGH</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_RD_ADC1_TP_LOW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA4</name>
                    <addressOffset>0x88</addressOffset>
                    <description>EFUSE_BLK3_RDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA5</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>EFUSE_BLK3_RDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA6</name>
                    <addressOffset>0x90</addressOffset>
                    <description>EFUSE_BLK3_RDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_RDATA7</name>
                    <addressOffset>0x94</addressOffset>
                    <description>EFUSE_BLK3_RDATA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DOUT7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA0</name>
                    <addressOffset>0x98</addressOffset>
                    <description>EFUSE_BLK1_WDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA1</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>EFUSE_BLK1_WDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA2</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>EFUSE_BLK1_WDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA3</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>EFUSE_BLK1_WDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA4</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>EFUSE_BLK1_WDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA5</name>
                    <addressOffset>0xac</addressOffset>
                    <description>EFUSE_BLK1_WDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA6</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>EFUSE_BLK1_WDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK1_WDATA7</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>EFUSE_BLK1_WDATA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK1_DIN7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA0</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>EFUSE_BLK2_WDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA1</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>EFUSE_BLK2_WDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA2</name>
                    <addressOffset>0xc0</addressOffset>
                    <description>EFUSE_BLK2_WDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA3</name>
                    <addressOffset>0xc4</addressOffset>
                    <description>EFUSE_BLK2_WDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA4</name>
                    <addressOffset>0xc8</addressOffset>
                    <description>EFUSE_BLK2_WDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA5</name>
                    <addressOffset>0xcc</addressOffset>
                    <description>EFUSE_BLK2_WDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA6</name>
                    <addressOffset>0xd0</addressOffset>
                    <description>EFUSE_BLK2_WDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK2_WDATA7</name>
                    <addressOffset>0xd4</addressOffset>
                    <description>EFUSE_BLK2_WDATA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK2_DIN7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
