nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>EFUSE_BLK3_WDATA0</name>
                    <addressOffset>0xd8</addressOffset>
                    <description>EFUSE_BLK3_WDATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_WDATA1</name>
                    <addressOffset>0xdc</addressOffset>
                    <description>EFUSE_BLK3_WDATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_WDATA2</name>
                    <addressOffset>0xe0</addressOffset>
                    <description>EFUSE_BLK3_WDATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_WDATA3</name>
                    <addressOffset>0xe4</addressOffset>
                    <description>EFUSE_BLK3_WDATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_ADC2_TP_HIGH</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_ADC2_TP_LOW</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_ADC1_TP_HIGH</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_ADC1_TP_LOW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_WDATA4</name>
                    <addressOffset>0xe8</addressOffset>
                    <description>EFUSE_BLK3_WDATA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_WDATA5</name>
                    <addressOffset>0xec</addressOffset>
                    <description>EFUSE_BLK3_WDATA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_WDATA6</name>
                    <addressOffset>0xf0</addressOffset>
                    <description>EFUSE_BLK3_WDATA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_BLK3_WDATA7</name>
                    <addressOffset>0xf4</addressOffset>
                    <description>EFUSE_BLK3_WDATA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_BLK3_DIN7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_CLK</name>
                    <addressOffset>0xf8</addressOffset>
                    <description>EFUSE_CLK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_CLK_EN</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CLK_SEL1</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_CLK_SEL0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_CONF</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>EFUSE_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_FORCE_NO_WR_RD_DIS</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_OP_CODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_STATUS</name>
                    <addressOffset>0x100</addressOffset>
                    <description>EFUSE_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_DEBUG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_CMD</name>
                    <addressOffset>0x104</addressOffset>
                    <description>EFUSE_CMD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_PGM_CMD</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_READ_CMD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_INT_RAW</name>
                    <addressOffset>0x108</addressOffset>
                    <description>EFUSE_INT_RAW</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_PGM_DONE_INT_RAW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_READ_DONE_INT_RAW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_INT_ST</name>
                    <addressOffset>0x10c</addressOffset>
                    <description>EFUSE_INT_ST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_PGM_DONE_INT_ST</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_READ_DONE_INT_ST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_INT_ENA</name>
                    <addressOffset>0x110</addressOffset>
                    <description>EFUSE_INT_ENA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_PGM_DONE_INT_ENA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_READ_DONE_INT_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_INT_CLR</name>
                    <addressOffset>0x114</addressOffset>
                    <description>EFUSE_INT_CLR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_PGM_DONE_INT_CLR</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_READ_DONE_INT_CLR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_DAC_CONF</name>
                    <addressOffset>0x118</addressOffset>
                    <description>EFUSE_DAC_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_DAC_CLK_PAD_SEL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EFUSE_DAC_CLK_DIV</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_DEC_STATUS</name>
                    <addressOffset>0x11c</addressOffset>
                    <description>EFUSE_DEC_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_DEC_WARNINGS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_DATE</name>
                    <addressOffset>0x1fc</addressOffset>
                    <description>EFUSE_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUSE_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
