nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RTCMEM1</name>
            <baseAddress>0x3ff62000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>I2C_EXT</name>
            <baseAddress>0x3ff53000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>RSA</name>
            <baseAddress>0x3ff02000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>PCNT</name>
            <baseAddress>0x3ff57000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x000005c0</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PCNT_U0_CONF0</name>
                    <addressOffset>0x0</addressOffset>
                    <description>PCNT_U0_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CH1_LCTRL_MODE_U0</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_HCTRL_MODE_U0</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_POS_MODE_U0</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_NEG_MODE_U0</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_LCTRL_MODE_U0</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_HCTRL_MODE_U0</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_POS_MODE_U0</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_NEG_MODE_U0</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES1_EN_U0</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES0_EN_U0</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_L_LIM_EN_U0</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_H_LIM_EN_U0</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_ZERO_EN_U0</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_EN_U0</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_THRES_U0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U0_CONF1</name>
                    <addressOffset>0x4</addressOffset>
                    <description>PCNT_U0_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_THRES1_U0</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_THRES0_U0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U0_CONF2</name>
                    <addressOffset>0x8</addressOffset>
                    <description>PCNT_U0_CONF2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_L_LIM_U0</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_H_LIM_U0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U1_CONF0</name>
                    <addressOffset>0xc</addressOffset>
                    <description>PCNT_U1_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CH1_LCTRL_MODE_U1</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_HCTRL_MODE_U1</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_POS_MODE_U1</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_NEG_MODE_U1</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_LCTRL_MODE_U1</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_HCTRL_MODE_U1</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_POS_MODE_U1</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_NEG_MODE_U1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES1_EN_U1</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES0_EN_U1</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_L_LIM_EN_U1</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_H_LIM_EN_U1</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_ZERO_EN_U1</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_EN_U1</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_THRES_U1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U1_CONF1</name>
                    <addressOffset>0x10</addressOffset>
                    <description>PCNT_U1_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_THRES1_U1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_THRES0_U1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U1_CONF2</name>
                    <addressOffset>0x14</addressOffset>
                    <description>PCNT_U1_CONF2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_L_LIM_U1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_H_LIM_U1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U2_CONF0</name>
                    <addressOffset>0x18</addressOffset>
                    <description>PCNT_U2_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CH1_LCTRL_MODE_U2</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_HCTRL_MODE_U2</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_POS_MODE_U2</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_NEG_MODE_U2</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_LCTRL_MODE_U2</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_HCTRL_MODE_U2</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_POS_MODE_U2</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_NEG_MODE_U2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES1_EN_U2</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES0_EN_U2</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_L_LIM_EN_U2</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_H_LIM_EN_U2</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_ZERO_EN_U2</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_EN_U2</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_THRES_U2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U2_CONF1</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>PCNT_U2_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_THRES1_U2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_THRES0_U2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U2_CONF2</name>
                    <addressOffset>0x20</addressOffset>
                    <description>PCNT_U2_CONF2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_L_LIM_U2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_H_LIM_U2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U3_CONF0</name>
                    <addressOffset>0x24</addressOffset>
                    <description>PCNT_U3_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CH1_LCTRL_MODE_U3</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_HCTRL_MODE_U3</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_POS_MODE_U3</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH1_NEG_MODE_U3</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_LCTRL_MODE_U3</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_HCTRL_MODE_U3</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_POS_MODE_U3</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CH0_NEG_MODE_U3</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES1_EN_U3</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_THRES0_EN_U3</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_L_LIM_EN_U3</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_H_LIM_EN_U3</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_THR_ZERO_EN_U3</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_EN_U3</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_FILTER_THRES_U3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U3_CONF1</name>
                    <addressOffset>0x28</addressOffset>
                    <description>PCNT_U3_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_THRES1_U3</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_THRES0_U3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNT_U3_CONF2</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>PCNT_U3_CONF2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT_CNT_L_LIM_U3</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>PCNT_CNT_H_LIM_U3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
