nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RMT</name>
            <baseAddress>0x3ff56000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x000006c0</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>RMT_CH0CONF0</name>
                    <addressOffset>0x20</addressOffset>
                    <description>RMT_CH0CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CLK_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_PD</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH0</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH0</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH0</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH0CONF1</name>
                    <addressOffset>0x24</addressOffset>
                    <description>RMT_CH0CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH0</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH0</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH0</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH0</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH0</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH0</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH0</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH0</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH0</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH0</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH0</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH1CONF0</name>
                    <addressOffset>0x28</addressOffset>
                    <description>RMT_CH1CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH1</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH1</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH1</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH1</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH1CONF1</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>RMT_CH1CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH1</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH1</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH1</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH1</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH1</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH1</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH1</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH1</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH2CONF0</name>
                    <addressOffset>0x30</addressOffset>
                    <description>RMT_CH2CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH2</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH2</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH2</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH2</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH2CONF1</name>
                    <addressOffset>0x34</addressOffset>
                    <description>RMT_CH2CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH2</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH2</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH2</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH2</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH2</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH2</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH2</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH2</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH2</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH2</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH2</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH3CONF0</name>
                    <addressOffset>0x38</addressOffset>
                    <description>RMT_CH3CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH3</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH3</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH3</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH3</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH3CONF1</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>RMT_CH3CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH3</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH3</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH3</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH3</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH3</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH3</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH3</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH3</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH3</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH3</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH3</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH3</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH4CONF0</name>
                    <addressOffset>0x40</addressOffset>
                    <description>RMT_CH4CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH4</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH4</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH4</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH4</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
