nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>RMT_CH4CONF1</name>
                    <addressOffset>0x44</addressOffset>
                    <description>RMT_CH4CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH4</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH4</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH4</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH4</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH4</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH4</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH4</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH4</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH4</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH4</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH4</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH4</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH5CONF0</name>
                    <addressOffset>0x48</addressOffset>
                    <description>RMT_CH5CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH5</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH5</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH5</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH5</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH5CONF1</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>RMT_CH5CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH5</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH5</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH5</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH5</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH5</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH5</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH5</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH5</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH5</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH5</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH5</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH5</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH6CONF0</name>
                    <addressOffset>0x50</addressOffset>
                    <description>RMT_CH6CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH6</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH6</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH6</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH6</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH6CONF1</name>
                    <addressOffset>0x54</addressOffset>
                    <description>RMT_CH6CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH6</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH6</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH6</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH6</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH6</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH6</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH6</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH6</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH6</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH6</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH6</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH6</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH7CONF0</name>
                    <addressOffset>0x58</addressOffset>
                    <description>RMT_CH7CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_CARRIER_OUT_LV_CH7</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_CARRIER_EN_CH7</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_SIZE_CH7</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_THRES_CH7</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RMT_DIV_CNT_CH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH7CONF1</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>RMT_CH7CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_IDLE_OUT_EN_CH7</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_IDLE_OUT_LV_CH7</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_ALWAYS_ON_CH7</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_REF_CNT_RST_CH7</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_THRES_CH7</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_FILTER_EN_CH7</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_CONTI_MODE_CH7</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_CH7</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RST_CH7</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RD_RST_CH7</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WR_RST_CH7</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_RX_EN_CH7</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_TX_START_CH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH0STATUS</name>
                    <addressOffset>0x60</addressOffset>
                    <description>RMT_CH0STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH0</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH0</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH0</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH0</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH0</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH0</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH0</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH1STATUS</name>
                    <addressOffset>0x64</addressOffset>
                    <description>RMT_CH1STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH1</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH1</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH1</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH1</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH1</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH1</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH1</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
