nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>RMT_CH2STATUS</name>
                    <addressOffset>0x68</addressOffset>
                    <description>RMT_CH2STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH2</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH2</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH2</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH2</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH2</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH2</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH2</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH3STATUS</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>RMT_CH3STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH3</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH3</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH3</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH3</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH3</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH3</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH3</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH4STATUS</name>
                    <addressOffset>0x70</addressOffset>
                    <description>RMT_CH4STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH4</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH4</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH4</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH4</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH4</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH4</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH4</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH5STATUS</name>
                    <addressOffset>0x74</addressOffset>
                    <description>RMT_CH5STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH5</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH5</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH5</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH5</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH5</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH5</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH5</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH6STATUS</name>
                    <addressOffset>0x78</addressOffset>
                    <description>RMT_CH6STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH6</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH6</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH6</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH6</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH6</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH6</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH6</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH7STATUS</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>RMT_CH7STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_STATUS_CH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_RD_ERR_CH7</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_APB_MEM_WR_ERR_CH7</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_EMPTY_CH7</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_FULL_CH7</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_OWNER_ERR_CH7</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMT_STATE_CH7</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_RADDR_EX_CH7</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RMT_MEM_WADDR_EX_CH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH0ADDR</name>
                    <addressOffset>0x80</addressOffset>
                    <description>RMT_CH0ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH1ADDR</name>
                    <addressOffset>0x84</addressOffset>
                    <description>RMT_CH1ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH2ADDR</name>
                    <addressOffset>0x88</addressOffset>
                    <description>RMT_CH2ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH3ADDR</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>RMT_CH3ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH4ADDR</name>
                    <addressOffset>0x90</addressOffset>
                    <description>RMT_CH4ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH5ADDR</name>
                    <addressOffset>0x94</addressOffset>
                    <description>RMT_CH5ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH6ADDR</name>
                    <addressOffset>0x98</addressOffset>
                    <description>RMT_CH6ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMT_CH7ADDR</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>RMT_CH7ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMT_APB_MEM_ADDR_CH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
