nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EMAC</name>
            <baseAddress>0x3ff69000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>RTCMEM2</name>
            <baseAddress>0x3ff63000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>GPIO</name>
            <baseAddress>0x3ff44000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00002e60</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>GPIO_BT_SELECT</name>
                    <addressOffset>0x0</addressOffset>
                    <description>GPIO_BT_SELECT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_BT_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT</name>
                    <addressOffset>0x4</addressOffset>
                    <description>GPIO_OUT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT_W1TS</name>
                    <addressOffset>0x8</addressOffset>
                    <description>GPIO_OUT_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_DATA_W1TS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT_W1TC</name>
                    <addressOffset>0xc</addressOffset>
                    <description>GPIO_OUT_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_DATA_W1TC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT1</name>
                    <addressOffset>0x10</addressOffset>
                    <description>GPIO_OUT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT1_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT1_W1TS</name>
                    <addressOffset>0x14</addressOffset>
                    <description>GPIO_OUT1_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT1_DATA_W1TS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT1_W1TC</name>
                    <addressOffset>0x18</addressOffset>
                    <description>GPIO_OUT1_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT1_DATA_W1TC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SDIO_SELECT</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>GPIO_SDIO_SELECT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SDIO_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE</name>
                    <addressOffset>0x20</addressOffset>
                    <description>GPIO_ENABLE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE_W1TS</name>
                    <addressOffset>0x24</addressOffset>
                    <description>GPIO_ENABLE_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE_DATA_W1TS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE_W1TC</name>
                    <addressOffset>0x28</addressOffset>
                    <description>GPIO_ENABLE_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE_DATA_W1TC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE1</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>GPIO_ENABLE1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE1_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE1_W1TS</name>
                    <addressOffset>0x30</addressOffset>
                    <description>GPIO_ENABLE1_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE1_DATA_W1TS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE1_W1TC</name>
                    <addressOffset>0x34</addressOffset>
                    <description>GPIO_ENABLE1_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE1_DATA_W1TC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STRAP</name>
                    <addressOffset>0x38</addressOffset>
                    <description>GPIO_STRAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STRAPPING</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_IN</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>GPIO_IN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_IN_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_IN1</name>
                    <addressOffset>0x40</addressOffset>
                    <description>GPIO_IN1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_IN1_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS</name>
                    <addressOffset>0x44</addressOffset>
                    <description>GPIO_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS_INT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS_W1TS</name>
                    <addressOffset>0x48</addressOffset>
                    <description>GPIO_STATUS_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS_INT_W1TS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS_W1TC</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>GPIO_STATUS_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS_INT_W1TC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS1</name>
                    <addressOffset>0x50</addressOffset>
                    <description>GPIO_STATUS1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS1_INT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS1_W1TS</name>
                    <addressOffset>0x54</addressOffset>
                    <description>GPIO_STATUS1_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS1_INT_W1TS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS1_W1TC</name>
                    <addressOffset>0x58</addressOffset>
                    <description>GPIO_STATUS1_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS1_INT_W1TC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ACPU_INT</name>
                    <addressOffset>0x60</addressOffset>
                    <description>GPIO_ACPU_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_APPCPU_INT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ACPU_NMI_INT</name>
                    <addressOffset>0x64</addressOffset>
                    <description>GPIO_ACPU_NMI_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_APPCPU_NMI_INT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PCPU_INT</name>
                    <addressOffset>0x68</addressOffset>
                    <description>GPIO_PCPU_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PROCPU_INT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PCPU_NMI_INT</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>GPIO_PCPU_NMI_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PROCPU_NMI_INT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_CPUSDIO_INT</name>
                    <addressOffset>0x70</addressOffset>
                    <description>GPIO_CPUSDIO_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SDIO_INT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ACPU_INT1</name>
                    <addressOffset>0x74</addressOffset>
                    <description>GPIO_ACPU_INT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_APPCPU_INT_H</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ACPU_NMI_INT1</name>
                    <addressOffset>0x78</addressOffset>
                    <description>GPIO_ACPU_NMI_INT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_APPCPU_NMI_INT_H</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PCPU_INT1</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>GPIO_PCPU_INT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PROCPU_INT_H</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PCPU_NMI_INT1</name>
                    <addressOffset>0x80</addressOffset>
                    <description>GPIO_PCPU_NMI_INT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PROCPU_NMI_INT_H</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_CPUSDIO_INT1</name>
                    <addressOffset>0x84</addressOffset>
                    <description>GPIO_CPUSDIO_INT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SDIO_INT_H</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN0</name>
                    <addressOffset>0x88</addressOffset>
                    <description>GPIO_PIN0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN0_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN0_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN0_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN0_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN0_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN1</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>GPIO_PIN1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN1_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN1_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN1_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN1_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN1_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
