nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>GPIO_PIN17</name>
                    <addressOffset>0xcc</addressOffset>
                    <description>GPIO_PIN17</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN17_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN17_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN17_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN17_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN17_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN18</name>
                    <addressOffset>0xd0</addressOffset>
                    <description>GPIO_PIN18</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN18_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN18_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN18_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN18_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN18_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN19</name>
                    <addressOffset>0xd4</addressOffset>
                    <description>GPIO_PIN19</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN19_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN19_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN19_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN19_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN19_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN20</name>
                    <addressOffset>0xd8</addressOffset>
                    <description>GPIO_PIN20</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN20_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN20_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN20_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN20_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN20_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN21</name>
                    <addressOffset>0xdc</addressOffset>
                    <description>GPIO_PIN21</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN21_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN21_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN21_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN21_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN21_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN22</name>
                    <addressOffset>0xe0</addressOffset>
                    <description>GPIO_PIN22</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN22_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN22_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN22_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN22_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN22_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN23</name>
                    <addressOffset>0xe4</addressOffset>
                    <description>GPIO_PIN23</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN23_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN23_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN23_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN23_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN23_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN24</name>
                    <addressOffset>0xe8</addressOffset>
                    <description>GPIO_PIN24</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN24_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN24_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN24_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN24_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN24_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN25</name>
                    <addressOffset>0xec</addressOffset>
                    <description>GPIO_PIN25</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN25_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN25_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN25_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN25_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN25_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN26</name>
                    <addressOffset>0xf0</addressOffset>
                    <description>GPIO_PIN26</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN26_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN26_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN26_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN26_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN26_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN27</name>
                    <addressOffset>0xf4</addressOffset>
                    <description>GPIO_PIN27</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN27_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN27_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN27_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN27_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN27_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN28</name>
                    <addressOffset>0xf8</addressOffset>
                    <description>GPIO_PIN28</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN28_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN28_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN28_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN28_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN28_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN29</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>GPIO_PIN29</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN29_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN29_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN29_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN29_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN29_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN30</name>
                    <addressOffset>0x100</addressOffset>
                    <description>GPIO_PIN30</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN30_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN30_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN30_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN30_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN30_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN31</name>
                    <addressOffset>0x104</addressOffset>
                    <description>GPIO_PIN31</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN31_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN31_CONFIG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN31_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN31_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_PIN31_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
