nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>GPIO_FUNC53_IN_SEL_CFG</name>
                    <addressOffset>0x204</addressOffset>
                    <description>GPIO_FUNC53_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG53_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC53_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC53_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC54_IN_SEL_CFG</name>
                    <addressOffset>0x208</addressOffset>
                    <description>GPIO_FUNC54_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG54_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC54_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC54_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC55_IN_SEL_CFG</name>
                    <addressOffset>0x20c</addressOffset>
                    <description>GPIO_FUNC55_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG55_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC55_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC55_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC56_IN_SEL_CFG</name>
                    <addressOffset>0x210</addressOffset>
                    <description>GPIO_FUNC56_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG56_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC56_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC56_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC57_IN_SEL_CFG</name>
                    <addressOffset>0x214</addressOffset>
                    <description>GPIO_FUNC57_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG57_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC57_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC57_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC58_IN_SEL_CFG</name>
                    <addressOffset>0x218</addressOffset>
                    <description>GPIO_FUNC58_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG58_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC58_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC58_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC59_IN_SEL_CFG</name>
                    <addressOffset>0x21c</addressOffset>
                    <description>GPIO_FUNC59_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG59_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC59_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC59_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC60_IN_SEL_CFG</name>
                    <addressOffset>0x220</addressOffset>
                    <description>GPIO_FUNC60_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG60_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC60_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC60_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC61_IN_SEL_CFG</name>
                    <addressOffset>0x224</addressOffset>
                    <description>GPIO_FUNC61_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG61_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC61_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC61_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC62_IN_SEL_CFG</name>
                    <addressOffset>0x228</addressOffset>
                    <description>GPIO_FUNC62_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG62_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC62_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC62_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC63_IN_SEL_CFG</name>
                    <addressOffset>0x22c</addressOffset>
                    <description>GPIO_FUNC63_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG63_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC63_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC63_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC64_IN_SEL_CFG</name>
                    <addressOffset>0x230</addressOffset>
                    <description>GPIO_FUNC64_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG64_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC64_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC64_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC65_IN_SEL_CFG</name>
                    <addressOffset>0x234</addressOffset>
                    <description>GPIO_FUNC65_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG65_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC65_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC65_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC66_IN_SEL_CFG</name>
                    <addressOffset>0x238</addressOffset>
                    <description>GPIO_FUNC66_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG66_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC66_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC66_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC67_IN_SEL_CFG</name>
                    <addressOffset>0x23c</addressOffset>
                    <description>GPIO_FUNC67_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG67_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC67_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC67_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC68_IN_SEL_CFG</name>
                    <addressOffset>0x240</addressOffset>
                    <description>GPIO_FUNC68_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG68_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC68_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC68_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC69_IN_SEL_CFG</name>
                    <addressOffset>0x244</addressOffset>
                    <description>GPIO_FUNC69_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG69_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC69_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC69_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC70_IN_SEL_CFG</name>
                    <addressOffset>0x248</addressOffset>
                    <description>GPIO_FUNC70_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG70_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC70_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC70_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC71_IN_SEL_CFG</name>
                    <addressOffset>0x24c</addressOffset>
                    <description>GPIO_FUNC71_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG71_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC71_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC71_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC72_IN_SEL_CFG</name>
                    <addressOffset>0x250</addressOffset>
                    <description>GPIO_FUNC72_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG72_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC72_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC72_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC73_IN_SEL_CFG</name>
                    <addressOffset>0x254</addressOffset>
                    <description>GPIO_FUNC73_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG73_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC73_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC73_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC74_IN_SEL_CFG</name>
                    <addressOffset>0x258</addressOffset>
                    <description>GPIO_FUNC74_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG74_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC74_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC74_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
