nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>GPIO_FUNC97_IN_SEL_CFG</name>
                    <addressOffset>0x2b4</addressOffset>
                    <description>GPIO_FUNC97_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG97_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC97_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC97_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC98_IN_SEL_CFG</name>
                    <addressOffset>0x2b8</addressOffset>
                    <description>GPIO_FUNC98_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG98_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC98_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC98_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC99_IN_SEL_CFG</name>
                    <addressOffset>0x2bc</addressOffset>
                    <description>GPIO_FUNC99_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG99_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC99_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC99_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC100_IN_SEL_CFG</name>
                    <addressOffset>0x2c0</addressOffset>
                    <description>GPIO_FUNC100_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG100_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC100_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC100_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC101_IN_SEL_CFG</name>
                    <addressOffset>0x2c4</addressOffset>
                    <description>GPIO_FUNC101_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG101_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC101_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC101_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC102_IN_SEL_CFG</name>
                    <addressOffset>0x2c8</addressOffset>
                    <description>GPIO_FUNC102_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG102_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC102_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC102_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC103_IN_SEL_CFG</name>
                    <addressOffset>0x2cc</addressOffset>
                    <description>GPIO_FUNC103_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG103_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC103_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC103_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC104_IN_SEL_CFG</name>
                    <addressOffset>0x2d0</addressOffset>
                    <description>GPIO_FUNC104_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG104_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC104_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC104_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC105_IN_SEL_CFG</name>
                    <addressOffset>0x2d4</addressOffset>
                    <description>GPIO_FUNC105_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG105_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC105_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC105_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC106_IN_SEL_CFG</name>
                    <addressOffset>0x2d8</addressOffset>
                    <description>GPIO_FUNC106_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG106_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC106_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC106_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC107_IN_SEL_CFG</name>
                    <addressOffset>0x2dc</addressOffset>
                    <description>GPIO_FUNC107_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG107_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC107_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC107_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC108_IN_SEL_CFG</name>
                    <addressOffset>0x2e0</addressOffset>
                    <description>GPIO_FUNC108_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG108_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC108_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC108_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC109_IN_SEL_CFG</name>
                    <addressOffset>0x2e4</addressOffset>
                    <description>GPIO_FUNC109_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG109_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC109_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC109_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC110_IN_SEL_CFG</name>
                    <addressOffset>0x2e8</addressOffset>
                    <description>GPIO_FUNC110_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG110_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC110_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC110_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC111_IN_SEL_CFG</name>
                    <addressOffset>0x2ec</addressOffset>
                    <description>GPIO_FUNC111_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG111_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC111_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC111_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC112_IN_SEL_CFG</name>
                    <addressOffset>0x2f0</addressOffset>
                    <description>GPIO_FUNC112_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG112_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC112_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC112_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC113_IN_SEL_CFG</name>
                    <addressOffset>0x2f4</addressOffset>
                    <description>GPIO_FUNC113_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG113_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC113_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC113_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC114_IN_SEL_CFG</name>
                    <addressOffset>0x2f8</addressOffset>
                    <description>GPIO_FUNC114_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG114_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC114_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC114_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC115_IN_SEL_CFG</name>
                    <addressOffset>0x2fc</addressOffset>
                    <description>GPIO_FUNC115_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG115_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC115_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC115_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC116_IN_SEL_CFG</name>
                    <addressOffset>0x300</addressOffset>
                    <description>GPIO_FUNC116_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG116_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC116_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC116_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC117_IN_SEL_CFG</name>
                    <addressOffset>0x304</addressOffset>
                    <description>GPIO_FUNC117_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG117_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC117_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC117_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC118_IN_SEL_CFG</name>
                    <addressOffset>0x308</addressOffset>
                    <description>GPIO_FUNC118_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG118_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC118_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC118_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
