nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>GPIO_FUNC119_IN_SEL_CFG</name>
                    <addressOffset>0x30c</addressOffset>
                    <description>GPIO_FUNC119_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG119_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC119_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC119_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC120_IN_SEL_CFG</name>
                    <addressOffset>0x310</addressOffset>
                    <description>GPIO_FUNC120_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG120_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC120_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC120_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC121_IN_SEL_CFG</name>
                    <addressOffset>0x314</addressOffset>
                    <description>GPIO_FUNC121_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG121_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC121_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC121_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC122_IN_SEL_CFG</name>
                    <addressOffset>0x318</addressOffset>
                    <description>GPIO_FUNC122_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG122_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC122_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC122_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC123_IN_SEL_CFG</name>
                    <addressOffset>0x31c</addressOffset>
                    <description>GPIO_FUNC123_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG123_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC123_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC123_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC124_IN_SEL_CFG</name>
                    <addressOffset>0x320</addressOffset>
                    <description>GPIO_FUNC124_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG124_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC124_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC124_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC125_IN_SEL_CFG</name>
                    <addressOffset>0x324</addressOffset>
                    <description>GPIO_FUNC125_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG125_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC125_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC125_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC126_IN_SEL_CFG</name>
                    <addressOffset>0x328</addressOffset>
                    <description>GPIO_FUNC126_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG126_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC126_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC126_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC127_IN_SEL_CFG</name>
                    <addressOffset>0x32c</addressOffset>
                    <description>GPIO_FUNC127_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG127_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC127_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC127_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC128_IN_SEL_CFG</name>
                    <addressOffset>0x330</addressOffset>
                    <description>GPIO_FUNC128_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG128_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC128_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC128_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC129_IN_SEL_CFG</name>
                    <addressOffset>0x334</addressOffset>
                    <description>GPIO_FUNC129_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG129_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC129_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC129_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC130_IN_SEL_CFG</name>
                    <addressOffset>0x338</addressOffset>
                    <description>GPIO_FUNC130_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG130_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC130_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC130_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC131_IN_SEL_CFG</name>
                    <addressOffset>0x33c</addressOffset>
                    <description>GPIO_FUNC131_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG131_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC131_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC131_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC132_IN_SEL_CFG</name>
                    <addressOffset>0x340</addressOffset>
                    <description>GPIO_FUNC132_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG132_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC132_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC132_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC133_IN_SEL_CFG</name>
                    <addressOffset>0x344</addressOffset>
                    <description>GPIO_FUNC133_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG133_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC133_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC133_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC134_IN_SEL_CFG</name>
                    <addressOffset>0x348</addressOffset>
                    <description>GPIO_FUNC134_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG134_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC134_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC134_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC135_IN_SEL_CFG</name>
                    <addressOffset>0x34c</addressOffset>
                    <description>GPIO_FUNC135_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG135_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC135_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC135_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC136_IN_SEL_CFG</name>
                    <addressOffset>0x350</addressOffset>
                    <description>GPIO_FUNC136_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG136_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC136_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC136_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC137_IN_SEL_CFG</name>
                    <addressOffset>0x354</addressOffset>
                    <description>GPIO_FUNC137_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG137_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC137_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC137_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC138_IN_SEL_CFG</name>
                    <addressOffset>0x358</addressOffset>
                    <description>GPIO_FUNC138_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG138_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC138_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC138_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC139_IN_SEL_CFG</name>
                    <addressOffset>0x35c</addressOffset>
                    <description>GPIO_FUNC139_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG139_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC139_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC139_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC140_IN_SEL_CFG</name>
                    <addressOffset>0x360</addressOffset>
                    <description>GPIO_FUNC140_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG140_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC140_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC140_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
