nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>GPIO_FUNC185_IN_SEL_CFG</name>
                    <addressOffset>0x414</addressOffset>
                    <description>GPIO_FUNC185_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG185_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC185_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC185_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC186_IN_SEL_CFG</name>
                    <addressOffset>0x418</addressOffset>
                    <description>GPIO_FUNC186_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG186_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC186_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC186_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC187_IN_SEL_CFG</name>
                    <addressOffset>0x41c</addressOffset>
                    <description>GPIO_FUNC187_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG187_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC187_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC187_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC188_IN_SEL_CFG</name>
                    <addressOffset>0x420</addressOffset>
                    <description>GPIO_FUNC188_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG188_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC188_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC188_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC189_IN_SEL_CFG</name>
                    <addressOffset>0x424</addressOffset>
                    <description>GPIO_FUNC189_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG189_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC189_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC189_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC190_IN_SEL_CFG</name>
                    <addressOffset>0x428</addressOffset>
                    <description>GPIO_FUNC190_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG190_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC190_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC190_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC191_IN_SEL_CFG</name>
                    <addressOffset>0x42c</addressOffset>
                    <description>GPIO_FUNC191_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG191_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC191_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC191_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC192_IN_SEL_CFG</name>
                    <addressOffset>0x430</addressOffset>
                    <description>GPIO_FUNC192_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG192_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC192_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC192_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC193_IN_SEL_CFG</name>
                    <addressOffset>0x434</addressOffset>
                    <description>GPIO_FUNC193_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG193_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC193_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC193_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC194_IN_SEL_CFG</name>
                    <addressOffset>0x438</addressOffset>
                    <description>GPIO_FUNC194_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG194_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC194_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC194_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC195_IN_SEL_CFG</name>
                    <addressOffset>0x43c</addressOffset>
                    <description>GPIO_FUNC195_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG195_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC195_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC195_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC196_IN_SEL_CFG</name>
                    <addressOffset>0x440</addressOffset>
                    <description>GPIO_FUNC196_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG196_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC196_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC196_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC197_IN_SEL_CFG</name>
                    <addressOffset>0x444</addressOffset>
                    <description>GPIO_FUNC197_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG197_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC197_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC197_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC198_IN_SEL_CFG</name>
                    <addressOffset>0x448</addressOffset>
                    <description>GPIO_FUNC198_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG198_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC198_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC198_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC199_IN_SEL_CFG</name>
                    <addressOffset>0x44c</addressOffset>
                    <description>GPIO_FUNC199_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG199_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC199_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC199_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC200_IN_SEL_CFG</name>
                    <addressOffset>0x450</addressOffset>
                    <description>GPIO_FUNC200_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG200_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC200_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC200_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC201_IN_SEL_CFG</name>
                    <addressOffset>0x454</addressOffset>
                    <description>GPIO_FUNC201_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG201_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC201_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC201_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC202_IN_SEL_CFG</name>
                    <addressOffset>0x458</addressOffset>
                    <description>GPIO_FUNC202_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG202_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC202_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC202_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC203_IN_SEL_CFG</name>
                    <addressOffset>0x45c</addressOffset>
                    <description>GPIO_FUNC203_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG203_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC203_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC203_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC204_IN_SEL_CFG</name>
                    <addressOffset>0x460</addressOffset>
                    <description>GPIO_FUNC204_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG204_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC204_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC204_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC205_IN_SEL_CFG</name>
                    <addressOffset>0x464</addressOffset>
                    <description>GPIO_FUNC205_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG205_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC205_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC205_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_FUNC206_IN_SEL_CFG</name>
                    <addressOffset>0x468</addressOffset>
                    <description>GPIO_FUNC206_IN_SEL_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SIG206_IN_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC206_IN_INV_SEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_FUNC206_IN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
