nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>UHCI_DMA_OUT_STATUS</name>
                    <addressOffset>0x14</addressOffset>
                    <description>UHCI_DMA_OUT_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUT_EMPTY</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_OUT_FULL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_OUT_PUSH</name>
                    <addressOffset>0x18</addressOffset>
                    <description>UHCI_DMA_OUT_PUSH</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUTFIFO_PUSH</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_OUTFIFO_WDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_STATUS</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>UHCI_DMA_IN_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_RX_ERR_CAUSE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_IN_EMPTY</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_IN_FULL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_POP</name>
                    <addressOffset>0x20</addressOffset>
                    <description>UHCI_DMA_IN_POP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_INFIFO_POP</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_INFIFO_RDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_OUT_LINK</name>
                    <addressOffset>0x24</addressOffset>
                    <description>UHCI_DMA_OUT_LINK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUTLINK_PARK</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_OUTLINK_RESTART</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_OUTLINK_START</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_OUTLINK_STOP</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_OUTLINK_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_LINK</name>
                    <addressOffset>0x28</addressOffset>
                    <description>UHCI_DMA_IN_LINK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_INLINK_PARK</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_INLINK_RESTART</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_INLINK_START</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_INLINK_STOP</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_INLINK_AUTO_RET</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_INLINK_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_CONF1</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>UHCI_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_DMA_INFIFO_FULL_THRS</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_SW_START</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_WAIT_SW_START</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_CHECK_OWNER</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TX_ACK_NUM_RE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TX_CHECK_SUM_RE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_SAVE_HEAD</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_CRC_DISABLE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_CHECK_SEQ_EN</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_CHECK_SUM_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_STATE0</name>
                    <addressOffset>0x30</addressOffset>
                    <description>UHCI_STATE0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_STATE0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_STATE1</name>
                    <addressOffset>0x34</addressOffset>
                    <description>UHCI_STATE1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_STATE1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_OUT_EOF_DES_ADDR</name>
                    <addressOffset>0x38</addressOffset>
                    <description>UHCI_DMA_OUT_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUT_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_SUC_EOF_DES_ADDR</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>UHCI_DMA_IN_SUC_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_IN_SUC_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_ERR_EOF_DES_ADDR</name>
                    <addressOffset>0x40</addressOffset>
                    <description>UHCI_DMA_IN_ERR_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_IN_ERR_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_OUT_EOF_BFR_DES_ADDR</name>
                    <addressOffset>0x44</addressOffset>
                    <description>UHCI_DMA_OUT_EOF_BFR_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUT_EOF_BFR_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_AHB_TEST</name>
                    <addressOffset>0x48</addressOffset>
                    <description>UHCI_AHB_TEST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_AHB_TESTADDR</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_AHB_TESTMODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_DSCR</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>UHCI_DMA_IN_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_INLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_DSCR_BF0</name>
                    <addressOffset>0x50</addressOffset>
                    <description>UHCI_DMA_IN_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_INLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_IN_DSCR_BF1</name>
                    <addressOffset>0x54</addressOffset>
                    <description>UHCI_DMA_IN_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_INLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_OUT_DSCR</name>
                    <addressOffset>0x58</addressOffset>
                    <description>UHCI_DMA_OUT_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUTLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_OUT_DSCR_BF0</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>UHCI_DMA_OUT_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUTLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DMA_OUT_DSCR_BF1</name>
                    <addressOffset>0x60</addressOffset>
                    <description>UHCI_DMA_OUT_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_OUTLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_ESCAPE_CONF</name>
                    <addressOffset>0x64</addressOffset>
                    <description>UHCI_ESCAPE_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_RX_13_ESC_EN</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_RX_11_ESC_EN</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_RX_DB_ESC_EN</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_RX_C0_ESC_EN</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TX_13_ESC_EN</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TX_11_ESC_EN</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TX_DB_ESC_EN</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TX_C0_ESC_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_HUNG_CONF</name>
                    <addressOffset>0x68</addressOffset>
                    <description>UHCI_HUNG_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_RXFIFO_TIMEOUT_ENA</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_RXFIFO_TIMEOUT_SHIFT</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_RXFIFO_TIMEOUT</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TXFIFO_TIMEOUT_ENA</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TXFIFO_TIMEOUT_SHIFT</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_TXFIFO_TIMEOUT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_RX_HEAD</name>
                    <addressOffset>0x70</addressOffset>
                    <description>UHCI_RX_HEAD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_RX_HEAD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_QUICK_SENT</name>
                    <addressOffset>0x74</addressOffset>
                    <description>UHCI_QUICK_SENT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_ALWAYS_SEND_EN</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_ALWAYS_SEND_NUM</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_SINGLE_SEND_EN</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_SINGLE_SEND_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
