nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>UHCI_Q0_WORD0</name>
                    <addressOffset>0x78</addressOffset>
                    <description>UHCI_Q0_WORD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q0_WORD0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q0_WORD1</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>UHCI_Q0_WORD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q0_WORD1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q1_WORD0</name>
                    <addressOffset>0x80</addressOffset>
                    <description>UHCI_Q1_WORD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q1_WORD0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q1_WORD1</name>
                    <addressOffset>0x84</addressOffset>
                    <description>UHCI_Q1_WORD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q1_WORD1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q2_WORD0</name>
                    <addressOffset>0x88</addressOffset>
                    <description>UHCI_Q2_WORD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q2_WORD0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q2_WORD1</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>UHCI_Q2_WORD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q2_WORD1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q3_WORD0</name>
                    <addressOffset>0x90</addressOffset>
                    <description>UHCI_Q3_WORD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q3_WORD0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q3_WORD1</name>
                    <addressOffset>0x94</addressOffset>
                    <description>UHCI_Q3_WORD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q3_WORD1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q4_WORD0</name>
                    <addressOffset>0x98</addressOffset>
                    <description>UHCI_Q4_WORD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q4_WORD0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q4_WORD1</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>UHCI_Q4_WORD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q4_WORD1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q5_WORD0</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>UHCI_Q5_WORD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q5_WORD0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q5_WORD1</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>UHCI_Q5_WORD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q5_WORD1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q6_WORD0</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>UHCI_Q6_WORD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q6_WORD0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_Q6_WORD1</name>
                    <addressOffset>0xac</addressOffset>
                    <description>UHCI_Q6_WORD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEND_Q6_WORD1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_ESC_CONF0</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>UHCI_ESC_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_SEPER_ESC_CHAR1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_SEPER_ESC_CHAR0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_SEPER_CHAR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_ESC_CONF1</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>UHCI_ESC_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_ESC_SEQ0_CHAR1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_ESC_SEQ0_CHAR0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_ESC_SEQ0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_ESC_CONF2</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>UHCI_ESC_CONF2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_ESC_SEQ1_CHAR1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_ESC_SEQ1_CHAR0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_ESC_SEQ1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_ESC_CONF3</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>UHCI_ESC_CONF3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_ESC_SEQ2_CHAR1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_ESC_SEQ2_CHAR0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>UHCI_ESC_SEQ2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_PKT_THRES</name>
                    <addressOffset>0xc0</addressOffset>
                    <description>UHCI_PKT_THRES</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_PKT_THRS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UHCI_DATE</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>UHCI_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UHCI_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
