nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SLCHOST</name>
            <baseAddress>0x3ff55000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000800</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>HOST_SLCHOST_FUNC2_0</name>
                    <addressOffset>0x10</addressOffset>
                    <description>HOST_SLCHOST_FUNC2_0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC_FUNC2_INT</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_FUNC2_1</name>
                    <addressOffset>0x14</addressOffset>
                    <description>HOST_SLCHOST_FUNC2_1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC_FUNC2_INT_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_FUNC2_2</name>
                    <addressOffset>0x20</addressOffset>
                    <description>HOST_SLCHOST_FUNC2_2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC_FUNC1_MDSTAT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_GPIO_STATUS0</name>
                    <addressOffset>0x34</addressOffset>
                    <description>HOST_SLCHOST_GPIO_STATUS0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_GPIO_SDIO_INT0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_GPIO_STATUS1</name>
                    <addressOffset>0x38</addressOffset>
                    <description>HOST_SLCHOST_GPIO_STATUS1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_GPIO_SDIO_INT1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_GPIO_IN0</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>HOST_SLCHOST_GPIO_IN0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_GPIO_SDIO_IN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_GPIO_IN1</name>
                    <addressOffset>0x40</addressOffset>
                    <description>HOST_SLCHOST_GPIO_IN1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_GPIO_SDIO_IN1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC0HOST_TOKEN_RDATA</name>
                    <addressOffset>0x44</addressOffset>
                    <description>HOST_SLC0HOST_TOKEN_RDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC0_RX_PF_EOF</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HOST_HOSTSLC0_TOKEN1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_PF_VALID</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC0_HOST_PF</name>
                    <addressOffset>0x48</addressOffset>
                    <description>HOST_SLC0_HOST_PF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC0_PF_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC1_HOST_PF</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>HOST_SLC1_HOST_PF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC1_PF_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC0HOST_INT_RAW</name>
                    <addressOffset>0x50</addressOffset>
                    <description>HOST_SLC0HOST_INT_RAW</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_GPIO_SDIO_INT_RAW</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_HOST_RD_RETRY_INT_RAW</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_NEW_PACKET_INT_RAW</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT3_INT_RAW</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT2_INT_RAW</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT1_INT_RAW</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT0_INT_RAW</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_PF_VALID_INT_RAW</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TX_OVF_INT_RAW</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_UDF_INT_RAW</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TX_START_INT_RAW</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_START_INT_RAW</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_EOF_INT_RAW</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_SOF_INT_RAW</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN1_0TO1_INT_RAW</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN0_0TO1_INT_RAW</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN1_1TO0_INT_RAW</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN0_1TO0_INT_RAW</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT7_INT_RAW</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT6_INT_RAW</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT5_INT_RAW</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT4_INT_RAW</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT3_INT_RAW</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT2_INT_RAW</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT1_INT_RAW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT0_INT_RAW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC1HOST_INT_RAW</name>
                    <addressOffset>0x54</addressOffset>
                    <description>HOST_SLC1HOST_INT_RAW</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC1_BT_RX_NEW_PACKET_INT_RAW</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_HOST_RD_RETRY_INT_RAW</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_WIFI_RX_NEW_PACKET_INT_RAW</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT3_INT_RAW</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT2_INT_RAW</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT1_INT_RAW</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT0_INT_RAW</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_RX_PF_VALID_INT_RAW</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TX_OVF_INT_RAW</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_RX_UDF_INT_RAW</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TX_START_INT_RAW</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_START_INT_RAW</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_EOF_INT_RAW</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_SOF_INT_RAW</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN1_0TO1_INT_RAW</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN0_0TO1_INT_RAW</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN1_1TO0_INT_RAW</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN0_1TO0_INT_RAW</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT7_INT_RAW</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT6_INT_RAW</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT5_INT_RAW</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT4_INT_RAW</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT3_INT_RAW</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT2_INT_RAW</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT1_INT_RAW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT0_INT_RAW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
