nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>HOST_SLCHOST_CONF_W5</name>
                    <addressOffset>0x80</addressOffset>
                    <description>HOST_SLCHOST_CONF_W5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF23</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF22</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF21</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF20</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W6</name>
                    <addressOffset>0x88</addressOffset>
                    <description>HOST_SLCHOST_CONF_W6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF27</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF26</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF25</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF24</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W7</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>HOST_SLCHOST_CONF_W7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF31</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF30</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF29</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF28</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_PKT_LEN0</name>
                    <addressOffset>0x90</addressOffset>
                    <description>HOST_SLCHOST_PKT_LEN0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_HOSTSLC0_LEN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_PKT_LEN1</name>
                    <addressOffset>0x94</addressOffset>
                    <description>HOST_SLCHOST_PKT_LEN1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_HOSTSLC0_LEN1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_PKT_LEN2</name>
                    <addressOffset>0x98</addressOffset>
                    <description>HOST_SLCHOST_PKT_LEN2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_HOSTSLC0_LEN2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W8</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>HOST_SLCHOST_CONF_W8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF35</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF34</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF33</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF32</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W9</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>HOST_SLCHOST_CONF_W9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF39</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF38</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF37</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF36</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W10</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>HOST_SLCHOST_CONF_W10</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF43</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF42</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF41</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF40</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W11</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>HOST_SLCHOST_CONF_W11</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF47</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF46</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF45</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF44</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W12</name>
                    <addressOffset>0xac</addressOffset>
                    <description>HOST_SLCHOST_CONF_W12</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF51</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF50</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF49</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF48</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W13</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>HOST_SLCHOST_CONF_W13</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF55</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF54</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF53</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF52</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W14</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>HOST_SLCHOST_CONF_W14</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF59</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF58</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF57</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF56</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF_W15</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>HOST_SLCHOST_CONF_W15</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CONF63</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF62</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF61</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_CONF60</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CHECK_SUM0</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>HOST_SLCHOST_CHECK_SUM0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CHECK_SUM0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CHECK_SUM1</name>
                    <addressOffset>0xc0</addressOffset>
                    <description>HOST_SLCHOST_CHECK_SUM1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_CHECK_SUM1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC1HOST_TOKEN_RDATA</name>
                    <addressOffset>0xc4</addressOffset>
                    <description>HOST_SLC1HOST_TOKEN_RDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC1_RX_PF_EOF</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HOST_HOSTSLC1_TOKEN1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_RX_PF_VALID</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC0HOST_TOKEN_WDATA</name>
                    <addressOffset>0xc8</addressOffset>
                    <description>HOST_SLC0HOST_TOKEN_WDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC0HOST_TOKEN1_WD</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TOKEN0_WD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC1HOST_TOKEN_WDATA</name>
                    <addressOffset>0xcc</addressOffset>
                    <description>HOST_SLC1HOST_TOKEN_WDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC1HOST_TOKEN1_WD</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TOKEN0_WD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_TOKEN_CON</name>
                    <addressOffset>0xd0</addressOffset>
                    <description>HOST_SLCHOST_TOKEN_CON</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC0HOST_LEN_WR</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TOKEN1_WR</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TOKEN0_WR</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TOKEN1_DEC</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TOKEN0_DEC</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TOKEN1_WR</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TOKEN0_WR</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TOKEN1_DEC</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TOKEN0_DEC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
