nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>HOST_SLC0HOST_INT_ENA</name>
                    <addressOffset>0xec</addressOffset>
                    <description>HOST_SLC0HOST_INT_ENA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_GPIO_SDIO_INT_ENA</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_HOST_RD_RETRY_INT_ENA</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_NEW_PACKET_INT_ENA</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT3_INT_ENA</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT2_INT_ENA</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT1_INT_ENA</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT0_INT_ENA</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_PF_VALID_INT_ENA</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TX_OVF_INT_ENA</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_UDF_INT_ENA</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TX_START_INT_ENA</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_START_INT_ENA</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_EOF_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_SOF_INT_ENA</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN1_0TO1_INT_ENA</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN0_0TO1_INT_ENA</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN1_1TO0_INT_ENA</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN0_1TO0_INT_ENA</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT7_INT_ENA</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT6_INT_ENA</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT5_INT_ENA</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT4_INT_ENA</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT3_INT_ENA</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT2_INT_ENA</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT1_INT_ENA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT0_INT_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC1HOST_INT_ENA</name>
                    <addressOffset>0xf0</addressOffset>
                    <description>HOST_SLC1HOST_INT_ENA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC1_BT_RX_NEW_PACKET_INT_ENA</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_HOST_RD_RETRY_INT_ENA</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT3_INT_ENA</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT2_INT_ENA</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT1_INT_ENA</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT0_INT_ENA</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_RX_PF_VALID_INT_ENA</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TX_OVF_INT_ENA</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_RX_UDF_INT_ENA</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TX_START_INT_ENA</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_START_INT_ENA</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_EOF_INT_ENA</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_SOF_INT_ENA</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN1_0TO1_INT_ENA</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN0_0TO1_INT_ENA</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN1_1TO0_INT_ENA</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN0_1TO0_INT_ENA</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT7_INT_ENA</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT6_INT_ENA</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT5_INT_ENA</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT4_INT_ENA</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT3_INT_ENA</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT2_INT_ENA</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT1_INT_ENA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT0_INT_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC0HOST_RX_INFOR</name>
                    <addressOffset>0xf4</addressOffset>
                    <description>HOST_SLC0HOST_RX_INFOR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC0HOST_RX_INFOR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC1HOST_RX_INFOR</name>
                    <addressOffset>0xf8</addressOffset>
                    <description>HOST_SLC1HOST_RX_INFOR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC1HOST_RX_INFOR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC0HOST_LEN_WD</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>HOST_SLC0HOST_LEN_WD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC0HOST_LEN_WD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC_APBWIN_WDATA</name>
                    <addressOffset>0x100</addressOffset>
                    <description>HOST_SLC_APBWIN_WDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC_APBWIN_WDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC_APBWIN_CONF</name>
                    <addressOffset>0x104</addressOffset>
                    <description>HOST_SLC_APBWIN_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC_APBWIN_START</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC_APBWIN_WR</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC_APBWIN_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC_APBWIN_RDATA</name>
                    <addressOffset>0x108</addressOffset>
                    <description>HOST_SLC_APBWIN_RDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC_APBWIN_RDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_RDCLR0</name>
                    <addressOffset>0x10c</addressOffset>
                    <description>HOST_SLCHOST_RDCLR0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_SLC0_BIT6_CLRADDR</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_SLC0_BIT7_CLRADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_RDCLR1</name>
                    <addressOffset>0x110</addressOffset>
                    <description>HOST_SLCHOST_RDCLR1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_SLC1_BIT6_CLRADDR</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLCHOST_SLC1_BIT7_CLRADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
