nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>HOST_SLC0HOST_INT_ENA1</name>
                    <addressOffset>0x114</addressOffset>
                    <description>HOST_SLC0HOST_INT_ENA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_GPIO_SDIO_INT_ENA1</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_HOST_RD_RETRY_INT_ENA1</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_NEW_PACKET_INT_ENA1</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT3_INT_ENA1</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT2_INT_ENA1</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT1_INT_ENA1</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_EXT_BIT0_INT_ENA1</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_PF_VALID_INT_ENA1</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TX_OVF_INT_ENA1</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_RX_UDF_INT_ENA1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_TX_START_INT_ENA1</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_START_INT_ENA1</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_EOF_INT_ENA1</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0HOST_RX_SOF_INT_ENA1</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN1_0TO1_INT_ENA1</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN0_0TO1_INT_ENA1</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN1_1TO0_INT_ENA1</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOKEN0_1TO0_INT_ENA1</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT7_INT_ENA1</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT6_INT_ENA1</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT5_INT_ENA1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT4_INT_ENA1</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT3_INT_ENA1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT2_INT_ENA1</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT1_INT_ENA1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC0_TOHOST_BIT0_INT_ENA1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLC1HOST_INT_ENA1</name>
                    <addressOffset>0x118</addressOffset>
                    <description>HOST_SLC1HOST_INT_ENA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_HOST_RD_RETRY_INT_ENA1</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT3_INT_ENA1</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT2_INT_ENA1</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT1_INT_ENA1</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_EXT_BIT0_INT_ENA1</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_RX_PF_VALID_INT_ENA1</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TX_OVF_INT_ENA1</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_RX_UDF_INT_ENA1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_TX_START_INT_ENA1</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_START_INT_ENA1</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_EOF_INT_ENA1</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1HOST_RX_SOF_INT_ENA1</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN1_0TO1_INT_ENA1</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN0_0TO1_INT_ENA1</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN1_1TO0_INT_ENA1</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOKEN0_1TO0_INT_ENA1</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT7_INT_ENA1</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT6_INT_ENA1</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT5_INT_ENA1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT4_INT_ENA1</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT3_INT_ENA1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT2_INT_ENA1</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT1_INT_ENA1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SLC1_TOHOST_BIT0_INT_ENA1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOSTDATE</name>
                    <addressOffset>0x178</addressOffset>
                    <description>HOST_SLCHOSTDATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOSTID</name>
                    <addressOffset>0x17c</addressOffset>
                    <description>HOST_SLCHOSTID</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SLCHOST_ID</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_CONF</name>
                    <addressOffset>0x1f0</addressOffset>
                    <description>HOST_SLCHOST_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_HSPEED_CON_EN</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SDIO_PAD_PULLUP</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SDIO20_INT_DELAY</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOST_FRC_QUICK_IN</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>HOST_FRC_POS_SAMP</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>HOST_FRC_NEG_SAMP</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>HOST_FRC_SDIO20</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>HOST_FRC_SDIO11</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOST_SLCHOST_INF_ST</name>
                    <addressOffset>0x1f4</addressOffset>
                    <description>HOST_SLCHOST_INF_ST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HOST_SDIO_QUICK_IN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SDIO_NEG_SAMP</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>HOST_SDIO20_MODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
