nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SLC</name>
            <baseAddress>0x3ff58000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000a60</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SLC_CONF0</name>
                    <addressOffset>0x0</addressOffset>
                    <description>SLC_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TOKEN_SEL</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_TOKEN_AUTO_CLR</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_TXDATA_BURST_EN</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_TXDSCR_BURST_EN</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_TXLINK_AUTO_RET</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RXLINK_AUTO_RET</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RXDATA_BURST_EN</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RXDSCR_BURST_EN</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RX_NO_RESTART_CLR</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RX_AUTO_WRBACK</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RX_LOOP_TEST</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_TX_LOOP_TEST</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_WR_RETRY_MASK_EN</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_WR_RETRY_MASK_EN</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RX_RST</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_TX_RST</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN_SEL</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN_AUTO_CLR</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TXDATA_BURST_EN</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TXDSCR_BURST_EN</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TXLINK_AUTO_RET</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RXLINK_AUTO_RET</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RXDATA_BURST_EN</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RXDSCR_BURST_EN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_NO_RESTART_CLR</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_AUTO_WRBACK</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_LOOP_TEST</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_LOOP_TEST</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_AHBM_RST</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_AHBM_FIFO_RST</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_RST</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_RST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0INT_RAW</name>
                    <addressOffset>0x4</addressOffset>
                    <description>SLC_0INT_RAW</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_QUICK_EOF_INT_RAW</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_CMD_DTC_INT_RAW</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_ERR_EOF_INT_RAW</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_WR_RETRY_DONE_INT_RAW</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_HOST_RD_ACK_INT_RAW</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DSCR_EMPTY_INT_RAW</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_DSCR_ERR_INT_RAW</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DSCR_ERR_INT_RAW</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOHOST_INT_RAW</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_EOF_INT_RAW</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_DONE_INT_RAW</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_SUC_EOF_INT_RAW</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DONE_INT_RAW</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN1_1TO0_INT_RAW</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN0_1TO0_INT_RAW</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_OVF_INT_RAW</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_UDF_INT_RAW</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_START_INT_RAW</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_START_INT_RAW</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT7_INT_RAW</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT6_INT_RAW</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT5_INT_RAW</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT4_INT_RAW</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT3_INT_RAW</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT2_INT_RAW</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT1_INT_RAW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT0_INT_RAW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0INT_ST</name>
                    <addressOffset>0x8</addressOffset>
                    <description>SLC_0INT_ST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_QUICK_EOF_INT_ST</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_CMD_DTC_INT_ST</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_ERR_EOF_INT_ST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_WR_RETRY_DONE_INT_ST</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_HOST_RD_ACK_INT_ST</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DSCR_EMPTY_INT_ST</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_DSCR_ERR_INT_ST</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DSCR_ERR_INT_ST</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOHOST_INT_ST</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_EOF_INT_ST</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_DONE_INT_ST</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_SUC_EOF_INT_ST</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DONE_INT_ST</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN1_1TO0_INT_ST</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN0_1TO0_INT_ST</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_OVF_INT_ST</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_UDF_INT_ST</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_START_INT_ST</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_START_INT_ST</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT7_INT_ST</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT6_INT_ST</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT5_INT_ST</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT4_INT_ST</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT3_INT_ST</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT2_INT_ST</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT1_INT_ST</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT0_INT_ST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
