nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>SLC_1_TO_EOF_DES_ADDR</name>
                    <addressOffset>0x84</addressOffset>
                    <description>SLC_1_TO_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TO_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_TX_EOF_DES_ADDR</name>
                    <addressOffset>0x88</addressOffset>
                    <description>SLC_1_TX_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TX_SUC_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_TO_EOF_BFR_DES_ADDR</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>SLC_1_TO_EOF_BFR_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TO_EOF_BFR_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_AHB_TEST</name>
                    <addressOffset>0x90</addressOffset>
                    <description>SLC_AHB_TEST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_AHB_TESTADDR</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SLC_AHB_TESTMODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_SDIO_ST</name>
                    <addressOffset>0x94</addressOffset>
                    <description>SLC_SDIO_ST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_FUNC2_ACC_STATE</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FUNC1_ACC_STATE</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SLC_BUS_ST</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SDIO_WAKEUP</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FUNC_ST</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SLC_CMD_ST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_RX_DSCR_CONF</name>
                    <addressOffset>0x98</addressOffset>
                    <description>SLC_RX_DSCR_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_RD_RETRY_THRESHOLD</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RX_FILL_EN</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RX_EOF_MODE</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_RX_FILL_MODE</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_INFOR_NO_REPLACE</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC1_TOKEN_NO_REPLACE</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RD_RETRY_THRESHOLD</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_FILL_EN</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_EOF_MODE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_FILL_MODE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_INFOR_NO_REPLACE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN_NO_REPLACE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TXLINK_DSCR</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>SLC_0_TXLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TXLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TXLINK_DSCR_BF0</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>SLC_0_TXLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TXLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TXLINK_DSCR_BF1</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>SLC_0_TXLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TXLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_RXLINK_DSCR</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>SLC_0_RXLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RXLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_RXLINK_DSCR_BF0</name>
                    <addressOffset>0xac</addressOffset>
                    <description>SLC_0_RXLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RXLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_RXLINK_DSCR_BF1</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>SLC_0_RXLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RXLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_TXLINK_DSCR</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>SLC_1_TXLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TXLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_TXLINK_DSCR_BF0</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>SLC_1_TXLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TXLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_TXLINK_DSCR_BF1</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>SLC_1_TXLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TXLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_RXLINK_DSCR</name>
                    <addressOffset>0xc0</addressOffset>
                    <description>SLC_1_RXLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_RXLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_RXLINK_DSCR_BF0</name>
                    <addressOffset>0xc4</addressOffset>
                    <description>SLC_1_RXLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_RXLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_RXLINK_DSCR_BF1</name>
                    <addressOffset>0xc8</addressOffset>
                    <description>SLC_1_RXLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_RXLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TX_ERREOF_DES_ADDR</name>
                    <addressOffset>0xcc</addressOffset>
                    <description>SLC_0_TX_ERREOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TX_ERR_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_1_TX_ERREOF_DES_ADDR</name>
                    <addressOffset>0xd0</addressOffset>
                    <description>SLC_1_TX_ERREOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TX_ERR_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_TOKEN_LAT</name>
                    <addressOffset>0xd4</addressOffset>
                    <description>SLC_TOKEN_LAT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_TOKEN</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_TX_DSCR_CONF</name>
                    <addressOffset>0xd8</addressOffset>
                    <description>SLC_TX_DSCR_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_WR_RETRY_THRESHOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_CMD_INFOR0</name>
                    <addressOffset>0xdc</addressOffset>
                    <description>SLC_CMD_INFOR0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_CMD_CONTENT0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_CMD_INFOR1</name>
                    <addressOffset>0xe0</addressOffset>
                    <description>SLC_CMD_INFOR1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_CMD_CONTENT1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_LEN_CONF</name>
                    <addressOffset>0xe4</addressOffset>
                    <description>SLC_0_LEN_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TX_NEW_PKT_IND</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_NEW_PKT_IND</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_GET_USED_DSCR</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_GET_USED_DSCR</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_PACKET_LOAD_EN</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_PACKET_LOAD_EN</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_LEN_INC_MORE</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_LEN_INC</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_LEN_WR</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_LEN_WDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_LENGTH</name>
                    <addressOffset>0xe8</addressOffset>
                    <description>SLC_0_LENGTH</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_LEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TXPKT_H_DSCR</name>
                    <addressOffset>0xec</addressOffset>
                    <description>SLC_0_TXPKT_H_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TX_PKT_H_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TXPKT_E_DSCR</name>
                    <addressOffset>0xf0</addressOffset>
                    <description>SLC_0_TXPKT_E_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TX_PKT_E_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
