nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>SLC_0_RXPKT_H_DSCR</name>
                    <addressOffset>0xf4</addressOffset>
                    <description>SLC_0_RXPKT_H_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_PKT_H_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_RXPKT_E_DSCR</name>
                    <addressOffset>0xf8</addressOffset>
                    <description>SLC_0_RXPKT_E_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_PKT_E_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TXPKTU_H_DSCR</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>SLC_0_TXPKTU_H_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TX_PKT_START_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_TXPKTU_E_DSCR</name>
                    <addressOffset>0x100</addressOffset>
                    <description>SLC_0_TXPKTU_E_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_TX_PKT_END_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_RXPKTU_H_DSCR</name>
                    <addressOffset>0x104</addressOffset>
                    <description>SLC_0_RXPKTU_H_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_PKT_START_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_RXPKTU_E_DSCR</name>
                    <addressOffset>0x108</addressOffset>
                    <description>SLC_0_RXPKTU_E_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_PKT_END_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_SEQ_POSITION</name>
                    <addressOffset>0x114</addressOffset>
                    <description>SLC_SEQ_POSITION</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC1_SEQ_POSITION</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_SEQ_POSITION</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_DSCR_REC_CONF</name>
                    <addressOffset>0x118</addressOffset>
                    <description>SLC_0_DSCR_REC_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_DSCR_REC_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_SDIO_CRC_ST0</name>
                    <addressOffset>0x11c</addressOffset>
                    <description>SLC_SDIO_CRC_ST0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_DAT3_CRC_ERR_CNT</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SLC_DAT2_CRC_ERR_CNT</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SLC_DAT1_CRC_ERR_CNT</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SLC_DAT0_CRC_ERR_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_SDIO_CRC_ST1</name>
                    <addressOffset>0x120</addressOffset>
                    <description>SLC_SDIO_CRC_ST1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_ERR_CNT_CLR</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_CMD_CRC_ERR_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_EOF_START_DES</name>
                    <addressOffset>0x124</addressOffset>
                    <description>SLC_0_EOF_START_DES</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_EOF_START_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_PUSH_DSCR_ADDR</name>
                    <addressOffset>0x128</addressOffset>
                    <description>SLC_0_PUSH_DSCR_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_PUSH_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_DONE_DSCR_ADDR</name>
                    <addressOffset>0x12c</addressOffset>
                    <description>SLC_0_DONE_DSCR_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_DONE_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_SUB_START_DES</name>
                    <addressOffset>0x130</addressOffset>
                    <description>SLC_0_SUB_START_DES</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_SUB_PAC_START_DSCR_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_DSCR_CNT</name>
                    <addressOffset>0x134</addressOffset>
                    <description>SLC_0_DSCR_CNT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_GET_EOF_OCC</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_DSCR_CNT_LAT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0_LEN_LIM_CONF</name>
                    <addressOffset>0x138</addressOffset>
                    <description>SLC_0_LEN_LIM_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_LEN_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLC_0INT_ST1</name>
                    <addressOffset>0x13c</addressOffset>
                    <description>SLC_0INT_ST1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLC_SLC0_RX_QUICK_EOF_INT_ST1</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_CMD_DTC_INT_ST1</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_ERR_EOF_INT_ST1</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_WR_RETRY_DONE_INT_ST1</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_HOST_RD_ACK_INT_ST1</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DSCR_EMPTY_INT_ST1</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_DSCR_ERR_INT_ST1</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DSCR_ERR_INT_ST1</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOHOST_INT_ST1</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_EOF_INT_ST1</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_DONE_INT_ST1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_SUC_EOF_INT_ST1</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_DONE_INT_ST1</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN1_1TO0_INT_ST1</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TOKEN0_1TO0_INT_ST1</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_OVF_INT_ST1</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_UDF_INT_ST1</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_TX_START_INT_ST1</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_SLC0_RX_START_INT_ST1</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT7_INT_ST1</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT6_INT_ST1</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT5_INT_ST1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT4_INT_ST1</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT3_INT_ST1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT2_INT_ST1</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT1_INT_ST1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLC_FRHOST_BIT0_INT_ST1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
