nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RTCMEM0</name>
            <baseAddress>0x3ff61000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>TIMERGROUP1</name>
            <baseAddress>0x3ff60000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>SHA</name>
            <baseAddress>0x3ff03000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>PWM1</name>
            <baseAddress>0x3ff6c000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>RTCCNTL</name>
            <baseAddress>0x3ff48000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x000006a0</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>RTC_CNTL_OPTIONS0</name>
                    <addressOffset>0x0</addressOffset>
                    <description>RTC_CNTL_OPTIONS0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SW_SYS_RST</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_WRAP_FORCE_NORST</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_WRAP_FORCE_RST</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ANALOG_FORCE_NOISO</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_PLL_FORCE_NOISO</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_XTL_FORCE_NOISO</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ANALOG_FORCE_ISO</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_PLL_FORCE_ISO</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_XTL_FORCE_ISO</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_CORE_FORCE_PU</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_CORE_FORCE_PD</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_CORE_FOLW_8M</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_I2C_FORCE_PU</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_I2C_FORCE_PD</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_I2C_FOLW_8M</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_FORCE_NOSLEEP</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_FORCE_SLEEP</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BIAS_SLEEP_FOLW_8M</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_XTL_FORCE_PU</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_XTL_FORCE_PD</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BBPLL_FORCE_PU</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BBPLL_FORCE_PD</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BBPLL_I2C_FORCE_PU</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BBPLL_I2C_FORCE_PD</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BB_I2C_FORCE_PU</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BB_I2C_FORCE_PD</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SW_PROCPU_RST</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SW_APPCPU_RST</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SW_STALL_PROCPU_C0</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SW_STALL_APPCPU_C0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_SLP_TIMER0</name>
                    <addressOffset>0x4</addressOffset>
                    <description>RTC_CNTL_SLP_TIMER0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SLP_VAL_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_SLP_TIMER1</name>
                    <addressOffset>0x8</addressOffset>
                    <description>RTC_CNTL_SLP_TIMER1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_MAIN_TIMER_ALARM_EN</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SLP_VAL_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIME_UPDATE</name>
                    <addressOffset>0xc</addressOffset>
                    <description>RTC_CNTL_TIME_UPDATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_TIME_UPDATE</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TIME_VALID</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIME0</name>
                    <addressOffset>0x10</addressOffset>
                    <description>RTC_CNTL_TIME0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_TIME_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIME1</name>
                    <addressOffset>0x14</addressOffset>
                    <description>RTC_CNTL_TIME1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_TIME_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_STATE0</name>
                    <addressOffset>0x18</addressOffset>
                    <description>RTC_CNTL_STATE0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SLEEP_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SLP_REJECT</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SLP_WAKEUP</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SDIO_ACTIVE_IND</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ULP_CP_SLP_TIMER_EN</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_SLP_TIMER_EN</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_APB2RTC_BRIDGE_SEL</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ULP_CP_WAKEUP_FORCE_EN</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_WAKEUP_FORCE_EN</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIMER1</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>RTC_CNTL_TIMER1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_PLL_BUF_WAIT</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_XTL_BUF_WAIT</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_CK8M_WAIT</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_CPU_STALL_WAIT</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_CPU_STALL_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIMER2</name>
                    <addressOffset>0x20</addressOffset>
                    <description>RTC_CNTL_TIMER2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_MIN_TIME_CK8M_OFF</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ULPCP_TOUCH_START_WAIT</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIMER3</name>
                    <addressOffset>0x24</addressOffset>
                    <description>RTC_CNTL_TIMER3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_ROM_RAM_POWERUP_TIMER</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ROM_RAM_WAIT_TIMER</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WIFI_POWERUP_TIMER</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WIFI_WAIT_TIMER</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIMER4</name>
                    <addressOffset>0x28</addressOffset>
                    <description>RTC_CNTL_TIMER4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_DG_WRAP_POWERUP_TIMER</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_WRAP_WAIT_TIMER</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_POWERUP_TIMER</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WAIT_TIMER</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TIMER5</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>RTC_CNTL_TIMER5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_RTCMEM_POWERUP_TIMER</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_RTCMEM_WAIT_TIMER</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_MIN_SLP_VAL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ULP_CP_SUBTIMER_PREDIV</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_ANA_CONF</name>
                    <addressOffset>0x30</addressOffset>
                    <description>RTC_CNTL_ANA_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_PLL_I2C_PU</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_CKGEN_I2C_PU</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_RFRX_PBUS_PU</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TXRF_I2C_PU</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_PVTMON_PU</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BBPLL_CAL_SLP_START</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_PLLA_FORCE_PU</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_PLLA_FORCE_PD</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
