nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>RTC_CNTL_DIG_ISO</name>
                    <addressOffset>0x88</addressOffset>
                    <description>RTC_CNTL_DIG_ISO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_DG_WRAP_FORCE_NOISO</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_WRAP_FORCE_ISO</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WIFI_FORCE_NOISO</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WIFI_FORCE_ISO</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM4_FORCE_NOISO</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM4_FORCE_ISO</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM3_FORCE_NOISO</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM3_FORCE_ISO</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM2_FORCE_NOISO</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM2_FORCE_ISO</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM1_FORCE_NOISO</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM1_FORCE_ISO</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM0_FORCE_NOISO</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_INTER_RAM0_FORCE_ISO</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ROM0_FORCE_NOISO</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ROM0_FORCE_ISO</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_PAD_FORCE_HOLD</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_PAD_FORCE_UNHOLD</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_PAD_FORCE_ISO</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_PAD_FORCE_NOISO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_PAD_AUTOHOLD_EN</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_CLR_DG_PAD_AUTOHOLD</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DG_PAD_AUTOHOLD</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DIG_ISO_FORCE_ON</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DIG_ISO_FORCE_OFF</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_WDTCONFIG0</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>RTC_CNTL_WDTCONFIG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_WDT_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_STG0</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_STG1</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_STG2</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_STG3</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_EDGE_INT_EN</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_LEVEL_INT_EN</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_CPU_RESET_LENGTH</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_SYS_RESET_LENGTH</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_FLASHBOOT_MOD_EN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_PROCPU_RESET_EN</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_APPCPU_RESET_EN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_WDT_PAUSE_IN_SLP</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_WDTCONFIG1</name>
                    <addressOffset>0x90</addressOffset>
                    <description>RTC_CNTL_WDTCONFIG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_WDT_STG0_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_WDTCONFIG2</name>
                    <addressOffset>0x94</addressOffset>
                    <description>RTC_CNTL_WDTCONFIG2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_WDT_STG1_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_WDTCONFIG3</name>
                    <addressOffset>0x98</addressOffset>
                    <description>RTC_CNTL_WDTCONFIG3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_WDT_STG2_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_WDTCONFIG4</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>RTC_CNTL_WDTCONFIG4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_WDT_STG3_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_WDTFEED</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>RTC_CNTL_WDTFEED</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_WDT_FEED</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_WDTWPROTECT</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>RTC_CNTL_WDTWPROTECT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_WDT_WKEY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_TEST_MUX</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>RTC_CNTL_TEST_MUX</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_DTEST_RTC</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ENT_RTC</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_SW_CPU_STALL</name>
                    <addressOffset>0xac</addressOffset>
                    <description>RTC_CNTL_SW_CPU_STALL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SW_STALL_PROCPU_C1</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SW_STALL_APPCPU_C1</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_STORE4</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>RTC_CNTL_STORE4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SCRATCH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_STORE5</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>RTC_CNTL_STORE5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SCRATCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_STORE6</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>RTC_CNTL_STORE6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SCRATCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_STORE7</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>RTC_CNTL_STORE7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_SCRATCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_DIAG1</name>
                    <addressOffset>0xc4</addressOffset>
                    <description>RTC_CNTL_DIAG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_LOW_POWER_DIAG1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_HOLD_FORCE</name>
                    <addressOffset>0xc8</addressOffset>
                    <description>RTC_CNTL_HOLD_FORCE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_X32N_HOLD_FORCE</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_X32P_HOLD_FORCE</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD7_HOLD_FORCE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD6_HOLD_FORCE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD5_HOLD_FORCE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD4_HOLD_FORCE</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD3_HOLD_FORCE</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD2_HOLD_FORCE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD1_HOLD_FORCE</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_TOUCH_PAD0_HOLD_FORCE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SENSE4_HOLD_FORCE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SENSE3_HOLD_FORCE</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SENSE2_HOLD_FORCE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_SENSE1_HOLD_FORCE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_PDAC2_HOLD_FORCE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_PDAC1_HOLD_FORCE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ADC2_HOLD_FORCE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_ADC1_HOLD_FORCE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_EXT_WAKEUP1</name>
                    <addressOffset>0xcc</addressOffset>
                    <description>RTC_CNTL_EXT_WAKEUP1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_EXT_WAKEUP1_STATUS_CLR</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_EXT_WAKEUP1_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
