nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>RTC_CNTL_EXT_WAKEUP1_STATUS</name>
                    <addressOffset>0xd0</addressOffset>
                    <description>RTC_CNTL_EXT_WAKEUP1_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_EXT_WAKEUP1_STATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_BROWN_OUT</name>
                    <addressOffset>0xd4</addressOffset>
                    <description>RTC_CNTL_BROWN_OUT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_BROWN_OUT_DET</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BROWN_OUT_ENA</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_DBROWN_OUT_THRES</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BROWN_OUT_RST_ENA</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BROWN_OUT_RST_WAIT</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BROWN_OUT_PD_RF_ENA</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CNTL_BROWN_OUT_CLOSE_FLASH_ENA</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CNTL_DATE</name>
                    <addressOffset>0x13c</addressOffset>
                    <description>RTC_CNTL_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CNTL_CNTL_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PWM2</name>
            <baseAddress>0x3ff6f000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>UHCI0</name>
            <baseAddress>0x3ff54000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>SENS</name>
            <baseAddress>0x3ff48800</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000540</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SENS_SAR_READ_CTRL</name>
                    <addressOffset>0x0</addressOffset>
                    <description>SENS_SAR_READ_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR1_DATA_INV</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_DIG_FORCE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_SAMPLE_NUM</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_CLK_GATED</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_SAMPLE_BIT</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_SAMPLE_CYCLE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_CLK_DIV</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_READ_STATUS1</name>
                    <addressOffset>0x4</addressOffset>
                    <description>SENS_SAR_READ_STATUS1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR1_READER_STATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_MEAS_WAIT1</name>
                    <addressOffset>0x8</addressOffset>
                    <description>SENS_SAR_MEAS_WAIT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR_AMP_WAIT2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR_AMP_WAIT1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_MEAS_WAIT2</name>
                    <addressOffset>0xc</addressOffset>
                    <description>SENS_SAR_MEAS_WAIT2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR2_RSTB_WAIT</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_FORCE_XPD_SAR</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SENS_FORCE_XPD_AMP</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR_AMP_WAIT3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_MEAS_CTRL</name>
                    <addressOffset>0x10</addressOffset>
                    <description>SENS_SAR_MEAS_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR2_XPD_WAIT</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR_RSTB_FSM</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SENS_XPD_SAR_FSM</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SENS_AMP_SHORT_REF_GND_FSM</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SENS_AMP_SHORT_REF_FSM</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SENS_AMP_RST_FB_FSM</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SENS_XPD_SAR_AMP_FSM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_READ_STATUS2</name>
                    <addressOffset>0x14</addressOffset>
                    <description>SENS_SAR_READ_STATUS2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR2_READER_STATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_ULP_CP_SLEEP_CYC0</name>
                    <addressOffset>0x18</addressOffset>
                    <description>SENS_ULP_CP_SLEEP_CYC0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SLEEP_CYCLES_S0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_ULP_CP_SLEEP_CYC1</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>SENS_ULP_CP_SLEEP_CYC1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SLEEP_CYCLES_S1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_ULP_CP_SLEEP_CYC2</name>
                    <addressOffset>0x20</addressOffset>
                    <description>SENS_ULP_CP_SLEEP_CYC2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SLEEP_CYCLES_S2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_ULP_CP_SLEEP_CYC3</name>
                    <addressOffset>0x24</addressOffset>
                    <description>SENS_ULP_CP_SLEEP_CYC3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SLEEP_CYCLES_S3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_ULP_CP_SLEEP_CYC4</name>
                    <addressOffset>0x28</addressOffset>
                    <description>SENS_ULP_CP_SLEEP_CYC4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SLEEP_CYCLES_S4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_START_FORCE</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>SENS_SAR_START_FORCE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR2_PWDET_EN</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_STOP</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_STOP</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_PC_INIT</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SARCLK_EN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_ULP_CP_START_TOP</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_ULP_CP_FORCE_START_TOP</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_PWDET_CCT</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_EN_TEST</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_BIT_WIDTH</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_BIT_WIDTH</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_MEM_WR_CTRL</name>
                    <addressOffset>0x30</addressOffset>
                    <description>SENS_SAR_MEM_WR_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_RTC_MEM_WR_OFFST_CLR</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEM_WR_ADDR_SIZE</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEM_WR_ADDR_INIT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_ATTEN1</name>
                    <addressOffset>0x34</addressOffset>
                    <description>SENS_SAR_ATTEN1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR1_ATTEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_ATTEN2</name>
                    <addressOffset>0x38</addressOffset>
                    <description>SENS_SAR_ATTEN2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR2_ATTEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_SLAVE_ADDR1</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>SENS_SAR_SLAVE_ADDR1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_MEAS_STATUS</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR0</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_SLAVE_ADDR2</name>
                    <addressOffset>0x40</addressOffset>
                    <description>SENS_SAR_SLAVE_ADDR2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR2</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_SLAVE_ADDR3</name>
                    <addressOffset>0x44</addressOffset>
                    <description>SENS_SAR_SLAVE_ADDR3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TSENS_RDY_OUT</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_OUT</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR4</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
