nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>SENS_SAR_SLAVE_ADDR4</name>
                    <addressOffset>0x48</addressOffset>
                    <description>SENS_SAR_SLAVE_ADDR4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_I2C_DONE</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_RDATA</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR6</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>SENS_I2C_SLAVE_ADDR7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TSENS_CTRL</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>SENS_SAR_TSENS_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TSENS_DUMP_OUT</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_POWER_UP_FORCE</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_POWER_UP</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_CLK_DIV</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_IN_INV</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_CLK_GATED</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_CLK_INV</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_XPD_FORCE</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TSENS_XPD_WAIT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_I2C_CTRL</name>
                    <addressOffset>0x50</addressOffset>
                    <description>SENS_SAR_I2C_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR_I2C_START_FORCE</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR_I2C_START</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR_I2C_CTRL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_MEAS_START1</name>
                    <addressOffset>0x54</addressOffset>
                    <description>SENS_SAR_MEAS_START1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR1_EN_PAD_FORCE</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR1_EN_PAD</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS1_START_FORCE</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS1_START_SAR</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS1_DONE_SAR</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS1_DATA_SAR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_CTRL1</name>
                    <addressOffset>0x58</addressOffset>
                    <description>SENS_SAR_TOUCH_CTRL1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_HALL_PHASE_FORCE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_XPD_HALL_FORCE</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_OUT_1EN</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_OUT_SEL</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_XPD_WAIT</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_DELAY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_THRES1</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>SENS_SAR_TOUCH_THRES1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_OUT_TH0</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_OUT_TH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_THRES2</name>
                    <addressOffset>0x60</addressOffset>
                    <description>SENS_SAR_TOUCH_THRES2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_OUT_TH2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_OUT_TH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_THRES3</name>
                    <addressOffset>0x64</addressOffset>
                    <description>SENS_SAR_TOUCH_THRES3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_OUT_TH4</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_OUT_TH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_THRES4</name>
                    <addressOffset>0x68</addressOffset>
                    <description>SENS_SAR_TOUCH_THRES4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_OUT_TH6</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_OUT_TH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_THRES5</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>SENS_SAR_TOUCH_THRES5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_OUT_TH8</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_OUT_TH9</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_OUT1</name>
                    <addressOffset>0x70</addressOffset>
                    <description>SENS_SAR_TOUCH_OUT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT0</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_OUT2</name>
                    <addressOffset>0x74</addressOffset>
                    <description>SENS_SAR_TOUCH_OUT2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_OUT3</name>
                    <addressOffset>0x78</addressOffset>
                    <description>SENS_SAR_TOUCH_OUT3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT4</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_OUT4</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>SENS_SAR_TOUCH_OUT4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT6</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_OUT5</name>
                    <addressOffset>0x80</addressOffset>
                    <description>SENS_SAR_TOUCH_OUT5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT8</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_OUT9</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_CTRL2</name>
                    <addressOffset>0x84</addressOffset>
                    <description>SENS_SAR_TOUCH_CTRL2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_MEAS_EN_CLR</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_SLEEP_CYCLES</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_START_FORCE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_START_EN</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_START_FSM_EN</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_DONE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_MEAS_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_TOUCH_ENABLE</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>SENS_SAR_TOUCH_ENABLE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_TOUCH_PAD_OUTEN1</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_PAD_OUTEN2</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>SENS_TOUCH_PAD_WORKEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_READ_CTRL2</name>
                    <addressOffset>0x90</addressOffset>
                    <description>SENS_SAR_READ_CTRL2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR2_DATA_INV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_DIG_FORCE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_PWDET_FORCE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_SAMPLE_NUM</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_CLK_GATED</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_SAMPLE_BIT</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_SAMPLE_CYCLE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_CLK_DIV</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SENS_SAR_MEAS_START2</name>
                    <addressOffset>0x94</addressOffset>
                    <description>SENS_SAR_MEAS_START2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SENS_SAR2_EN_PAD_FORCE</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_SAR2_EN_PAD</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS2_START_FORCE</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS2_START_SAR</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS2_DONE_SAR</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SENS_MEAS2_DATA_SAR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
