nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>NRX</name>
            <baseAddress>0x3ff5cc00</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>RTCIO</name>
            <baseAddress>0x3ff48400</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000660</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>RTC_GPIO_OUT</name>
                    <addressOffset>0x0</addressOffset>
                    <description>RTC_GPIO_OUT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_OUT_DATA</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_OUT_W1TS</name>
                    <addressOffset>0x4</addressOffset>
                    <description>RTC_GPIO_OUT_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_OUT_DATA_W1TS</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_OUT_W1TC</name>
                    <addressOffset>0x8</addressOffset>
                    <description>RTC_GPIO_OUT_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_OUT_DATA_W1TC</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_ENABLE</name>
                    <addressOffset>0xc</addressOffset>
                    <description>RTC_GPIO_ENABLE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_ENABLE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_ENABLE_W1TS</name>
                    <addressOffset>0x10</addressOffset>
                    <description>RTC_GPIO_ENABLE_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_ENABLE_W1TS</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_ENABLE_W1TC</name>
                    <addressOffset>0x14</addressOffset>
                    <description>RTC_GPIO_ENABLE_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_ENABLE_W1TC</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_STATUS</name>
                    <addressOffset>0x18</addressOffset>
                    <description>RTC_GPIO_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_STATUS_INT</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_STATUS_W1TS</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>RTC_GPIO_STATUS_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_STATUS_INT_W1TS</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_STATUS_W1TC</name>
                    <addressOffset>0x20</addressOffset>
                    <description>RTC_GPIO_STATUS_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_STATUS_INT_W1TC</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_IN</name>
                    <addressOffset>0x24</addressOffset>
                    <description>RTC_GPIO_IN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_IN_NEXT</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN0</name>
                    <addressOffset>0x28</addressOffset>
                    <description>RTC_GPIO_PIN0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN0_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN0_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN0_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN1</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>RTC_GPIO_PIN1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN1_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN1_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN1_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN2</name>
                    <addressOffset>0x30</addressOffset>
                    <description>RTC_GPIO_PIN2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN2_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN2_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN2_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN3</name>
                    <addressOffset>0x34</addressOffset>
                    <description>RTC_GPIO_PIN3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN3_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN3_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN3_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN4</name>
                    <addressOffset>0x38</addressOffset>
                    <description>RTC_GPIO_PIN4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN4_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN4_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN4_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN5</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>RTC_GPIO_PIN5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN5_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN5_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN5_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN6</name>
                    <addressOffset>0x40</addressOffset>
                    <description>RTC_GPIO_PIN6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN6_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN6_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN6_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN7</name>
                    <addressOffset>0x44</addressOffset>
                    <description>RTC_GPIO_PIN7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN7_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN7_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN7_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN8</name>
                    <addressOffset>0x48</addressOffset>
                    <description>RTC_GPIO_PIN8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN8_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN8_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN8_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN9</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>RTC_GPIO_PIN9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN9_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN9_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN9_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN10</name>
                    <addressOffset>0x50</addressOffset>
                    <description>RTC_GPIO_PIN10</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN10_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN10_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN10_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN11</name>
                    <addressOffset>0x54</addressOffset>
                    <description>RTC_GPIO_PIN11</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN11_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN11_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN11_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN12</name>
                    <addressOffset>0x58</addressOffset>
                    <description>RTC_GPIO_PIN12</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN12_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN12_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN12_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN13</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>RTC_GPIO_PIN13</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN13_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN13_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN13_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_GPIO_PIN14</name>
                    <addressOffset>0x60</addressOffset>
                    <description>RTC_GPIO_PIN14</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_GPIO_PIN14_WAKEUP_ENABLE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN14_INT_TYPE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_GPIO_PIN14_PAD_DRIVER</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
