nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>RTC_IO_XTAL_32K_PAD</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>RTC_IO_XTAL_32K_PAD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_X32N_DRV</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_HOLD</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_DRV</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_HOLD</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_RDE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_RUE</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_DAC_XTAL_32K</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_XPD_XTAL_32K</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_MUX_SEL</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_MUX_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_FUN_SEL</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_SLP_SEL</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_SLP_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_SLP_OE</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32N_FUN_IE</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_FUN_SEL</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_SLP_SEL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_SLP_IE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_SLP_OE</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_X32P_FUN_IE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_DRES_XTAL_32K</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_DBIAS_XTAL_32K</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_CFG</name>
                    <addressOffset>0x90</addressOffset>
                    <description>RTC_IO_TOUCH_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_XPD_BIAS</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_DREFH</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_DREFL</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_DRANGE</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_DCUR</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD0</name>
                    <addressOffset>0x94</addressOffset>
                    <description>RTC_IO_TOUCH_PAD0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD0_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD1</name>
                    <addressOffset>0x98</addressOffset>
                    <description>RTC_IO_TOUCH_PAD1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD1_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD2</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>RTC_IO_TOUCH_PAD2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD2_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD3</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>RTC_IO_TOUCH_PAD3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD3_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
