nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>RTC_IO_TOUCH_PAD4</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>RTC_IO_TOUCH_PAD4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD4_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD5</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>RTC_IO_TOUCH_PAD5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD5_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD6</name>
                    <addressOffset>0xac</addressOffset>
                    <description>RTC_IO_TOUCH_PAD6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD6_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD7</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>RTC_IO_TOUCH_PAD7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_HOLD</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_DRV</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_RDE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_RUE</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_MUX_SEL</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_FUN_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_SLP_SEL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_SLP_IE</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_SLP_OE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_FUN_IE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD7_TO_GPIO</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD8</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>RTC_IO_TOUCH_PAD8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD8_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD8_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD8_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD8_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD8_TO_GPIO</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_TOUCH_PAD9</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>RTC_IO_TOUCH_PAD9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_TOUCH_PAD9_DAC</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD9_START</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD9_TIE_OPT</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD9_XPD</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_TOUCH_PAD9_TO_GPIO</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_EXT_WAKEUP0</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>RTC_IO_EXT_WAKEUP0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_EXT_WAKEUP0_SEL</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_XTL_EXT_CTR</name>
                    <addressOffset>0xc0</addressOffset>
                    <description>RTC_IO_XTL_EXT_CTR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_XTL_EXT_CTR_SEL</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_SAR_I2C_IO</name>
                    <addressOffset>0xc4</addressOffset>
                    <description>RTC_IO_SAR_I2C_IO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_SAR_I2C_SDA_SEL</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_SAR_I2C_SCL_SEL</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_IO_SAR_DEBUG_BIT_SEL</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_IO_DATE</name>
                    <addressOffset>0xc8</addressOffset>
                    <description>RTC_IO_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_IO_IO_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
