nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FE</name>
            <baseAddress>0x3ff46000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>BB</name>
            <baseAddress>0x3ff5d000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>DPORT</name>
            <baseAddress>0x3ff00000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00002de0</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DPORT_PRO_BOOT_REMAP_CTRL</name>
                    <addressOffset>0x0</addressOffset>
                    <description>DPORT_PRO_BOOT_REMAP_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_BOOT_REMAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_BOOT_REMAP_CTRL</name>
                    <addressOffset>0x4</addressOffset>
                    <description>DPORT_APP_BOOT_REMAP_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_BOOT_REMAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ACCESS_CHECK</name>
                    <addressOffset>0x8</addressOffset>
                    <description>DPORT_ACCESS_CHECK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_ACCESS_CHECK_APP</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_ACCESS_CHECK_PRO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DPORT_APB_MASK0</name>
                    <addressOffset>0xc</addressOffset>
                    <description>DPORT_PRO_DPORT_APB_MASK0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRODPORT_APB_MASK0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DPORT_APB_MASK1</name>
                    <addressOffset>0x10</addressOffset>
                    <description>DPORT_PRO_DPORT_APB_MASK1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRODPORT_APB_MASK1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DPORT_APB_MASK0</name>
                    <addressOffset>0x14</addressOffset>
                    <description>DPORT_APP_DPORT_APB_MASK0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APPDPORT_APB_MASK0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DPORT_APB_MASK1</name>
                    <addressOffset>0x18</addressOffset>
                    <description>DPORT_APP_DPORT_APB_MASK1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APPDPORT_APB_MASK1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PERI_CLK_EN</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>DPORT_PERI_CLK_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PERI_CLK_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PERI_RST_EN</name>
                    <addressOffset>0x20</addressOffset>
                    <description>DPORT_PERI_RST_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PERI_RST_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_WIFI_BB_CFG</name>
                    <addressOffset>0x24</addressOffset>
                    <description>DPORT_WIFI_BB_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_WIFI_BB_CFG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_WIFI_BB_CFG_2</name>
                    <addressOffset>0x28</addressOffset>
                    <description>DPORT_WIFI_BB_CFG_2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_WIFI_BB_CFG_2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APPCPU_CTRL_A</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>DPORT_APPCPU_CTRL_A</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APPCPU_RESETTING</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APPCPU_CTRL_B</name>
                    <addressOffset>0x30</addressOffset>
                    <description>DPORT_APPCPU_CTRL_B</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APPCPU_CLKGATE_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APPCPU_CTRL_C</name>
                    <addressOffset>0x34</addressOffset>
                    <description>DPORT_APPCPU_CTRL_C</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APPCPU_RUNSTALL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APPCPU_CTRL_D</name>
                    <addressOffset>0x38</addressOffset>
                    <description>DPORT_APPCPU_CTRL_D</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APPCPU_BOOT_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CPU_PER_CONF</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>DPORT_CPU_PER_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_FAST_CLK_RTC_SEL</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_LOWSPEED_CLK_SEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CPUPERIOD_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CACHE_CTRL</name>
                    <addressOffset>0x40</addressOffset>
                    <description>DPORT_PRO_CACHE_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_DRAM_HL</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SLAVE_REQ</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHB_SPI_REQ</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_SLAVE_REQ</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_AHB_SPI_REQ</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_DRAM_SPLIT</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_SINGLE_IRAM_ENA</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_3_EN</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_2_EN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_1_EN</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_0_EN</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_FLUSH_DONE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_FLUSH_ENA</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_ENABLE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MODE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CACHE_CTRL1</name>
                    <addressOffset>0x44</addressOffset>
                    <description>DPORT_PRO_CACHE_CTRL1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_MMU_IA_CLR</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CMMU_PD</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CMMU_FORCE_ON</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CMMU_FLASH_PAGE_MODE</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CMMU_SRAM_PAGE_MODE</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MASK_OPSDRAM</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MASK_DROM0</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MASK_DRAM1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MASK_IROM0</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MASK_IRAM1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MASK_IRAM0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CACHE_LOCK_0_ADDR</name>
                    <addressOffset>0x48</addressOffset>
                    <description>DPORT_PRO_CACHE_LOCK_0_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_0_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_0_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_0_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CACHE_LOCK_1_ADDR</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>DPORT_PRO_CACHE_LOCK_1_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_1_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_1_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_1_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CACHE_LOCK_2_ADDR</name>
                    <addressOffset>0x50</addressOffset>
                    <description>DPORT_PRO_CACHE_LOCK_2_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_2_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_2_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_2_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CACHE_LOCK_3_ADDR</name>
                    <addressOffset>0x54</addressOffset>
                    <description>DPORT_PRO_CACHE_LOCK_3_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_3_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_3_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_LOCK_3_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
