nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_APP_CACHE_CTRL</name>
                    <addressOffset>0x58</addressOffset>
                    <description>DPORT_APP_CACHE_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_DRAM_HL</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_SLAVE_REQ</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_AHB_SPI_REQ</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_DRAM_SPLIT</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_SINGLE_IRAM_ENA</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_3_EN</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_2_EN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_1_EN</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_0_EN</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_FLUSH_DONE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_FLUSH_ENA</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_ENABLE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MODE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CACHE_CTRL1</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>DPORT_APP_CACHE_CTRL1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_MMU_IA_CLR</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CMMU_PD</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CMMU_FORCE_ON</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CMMU_FLASH_PAGE_MODE</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CMMU_SRAM_PAGE_MODE</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MASK_OPSDRAM</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MASK_DROM0</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MASK_DRAM1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MASK_IROM0</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MASK_IRAM1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MASK_IRAM0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CACHE_LOCK_0_ADDR</name>
                    <addressOffset>0x60</addressOffset>
                    <description>DPORT_APP_CACHE_LOCK_0_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_0_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_0_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_0_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CACHE_LOCK_1_ADDR</name>
                    <addressOffset>0x64</addressOffset>
                    <description>DPORT_APP_CACHE_LOCK_1_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_1_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_1_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_1_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CACHE_LOCK_2_ADDR</name>
                    <addressOffset>0x68</addressOffset>
                    <description>DPORT_APP_CACHE_LOCK_2_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_2_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_2_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_2_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CACHE_LOCK_3_ADDR</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>DPORT_APP_CACHE_LOCK_3_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_3_ADDR_MAX</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_3_ADDR_MIN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_LOCK_3_ADDR_PRE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_TRACEMEM_MUX_MODE</name>
                    <addressOffset>0x70</addressOffset>
                    <description>DPORT_TRACEMEM_MUX_MODE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_TRACEMEM_MUX_MODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TRACEMEM_ENA</name>
                    <addressOffset>0x74</addressOffset>
                    <description>DPORT_PRO_TRACEMEM_ENA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TRACEMEM_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TRACEMEM_ENA</name>
                    <addressOffset>0x78</addressOffset>
                    <description>DPORT_APP_TRACEMEM_ENA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TRACEMEM_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CACHE_MUX_MODE</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>DPORT_CACHE_MUX_MODE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CACHE_MUX_MODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_PAGE_MODE</name>
                    <addressOffset>0x80</addressOffset>
                    <description>DPORT_IMMU_PAGE_MODE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_PAGE_MODE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_INTERNAL_SRAM_IMMU_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_PAGE_MODE</name>
                    <addressOffset>0x84</addressOffset>
                    <description>DPORT_DMMU_PAGE_MODE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_PAGE_MODE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_INTERNAL_SRAM_DMMU_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ROM_MPU_ENA</name>
                    <addressOffset>0x88</addressOffset>
                    <description>DPORT_ROM_MPU_ENA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_ROM_MPU_ENA</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_ROM_MPU_ENA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SHARE_ROM_MPU_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_MEM_PD_MASK</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>DPORT_MEM_PD_MASK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_LSLP_MEM_PD_MASK</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ROM_PD_CTRL</name>
                    <addressOffset>0x90</addressOffset>
                    <description>DPORT_ROM_PD_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHARE_ROM_PD</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_ROM_PD</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_ROM_PD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ROM_FO_CTRL</name>
                    <addressOffset>0x94</addressOffset>
                    <description>DPORT_ROM_FO_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHARE_ROM_FO</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_ROM_FO</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_ROM_FO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SRAM_PD_CTRL_0</name>
                    <addressOffset>0x98</addressOffset>
                    <description>DPORT_SRAM_PD_CTRL_0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SRAM_PD_0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SRAM_PD_CTRL_1</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>DPORT_SRAM_PD_CTRL_1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SRAM_PD_1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SRAM_FO_CTRL_0</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>DPORT_SRAM_FO_CTRL_0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SRAM_FO_0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SRAM_FO_CTRL_1</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>DPORT_SRAM_FO_CTRL_1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SRAM_FO_1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IRAM_DRAM_AHB_SEL</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>DPORT_IRAM_DRAM_AHB_SEL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_MAC_DUMP_MODE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_MASK_AHB</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_MASK_APP_DRAM</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_MASK_PRO_DRAM</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_MASK_APP_IRAM</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_MASK_PRO_IRAM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
