nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_TAG_FO_CTRL</name>
                    <addressOffset>0xac</addressOffset>
                    <description>DPORT_TAG_FO_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_TAG_PD</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_TAG_FORCE_ON</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_TAG_PD</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_TAG_FORCE_ON</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHB_LITE_MASK</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>DPORT_AHB_LITE_MASK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_AHB_LITE_SDHOST_PID_REG</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHB_LITE_MASK_APPDPORT</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHB_LITE_MASK_PRODPORT</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHB_LITE_MASK_SDIO</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHB_LITE_MASK_APP</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHB_LITE_MASK_PRO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHB_MPU_TABLE_0</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>DPORT_AHB_MPU_TABLE_0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_AHB_ACCESS_GRANT_0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHB_MPU_TABLE_1</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>DPORT_AHB_MPU_TABLE_1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_AHB_ACCESS_GRANT_1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_HOST_INF_SEL</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>DPORT_HOST_INF_SEL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_LINK_DEVICE_SEL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PERI_IO_SWAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PERIP_CLK_EN</name>
                    <addressOffset>0xc0</addressOffset>
                    <description>DPORT_PERIP_CLK_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PERIP_CLK_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PERIP_RST_EN</name>
                    <addressOffset>0xc4</addressOffset>
                    <description>DPORT_PERIP_RST_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PERIP_RST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SPI_DECRYPT_ENABLE</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SPI_ENCRYPT_ENABLE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SLAVE_SPI_MASK_APP</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SLAVE_SPI_MASK_PRO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_WIFI_CLK_EN</name>
                    <addressOffset>0xcc</addressOffset>
                    <description>DPORT_WIFI_CLK_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_WIFI_CLK_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CORE_RST_EN</name>
                    <addressOffset>0xd0</addressOffset>
                    <description>DPORT_CORE_RST_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CORE_RST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_BT_LPCK_DIV_INT</name>
                    <addressOffset>0xd4</addressOffset>
                    <description>DPORT_BT_LPCK_DIV_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_BTEXTWAKEUP_REQ</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_BT_LPCK_DIV_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_BT_LPCK_DIV_FRAC</name>
                    <addressOffset>0xd8</addressOffset>
                    <description>DPORT_BT_LPCK_DIV_FRAC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_LPCLK_SEL_XTAL32K</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_LPCLK_SEL_XTAL</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_LPCLK_SEL_8M</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_LPCLK_SEL_RTC_SLOW</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_BT_LPCK_DIV_A</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_BT_LPCK_DIV_B</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CPU_INTR_FROM_CPU_0</name>
                    <addressOffset>0xdc</addressOffset>
                    <description>DPORT_CPU_INTR_FROM_CPU_0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CPU_INTR_FROM_CPU_0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CPU_INTR_FROM_CPU_1</name>
                    <addressOffset>0xe0</addressOffset>
                    <description>DPORT_CPU_INTR_FROM_CPU_1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CPU_INTR_FROM_CPU_1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CPU_INTR_FROM_CPU_2</name>
                    <addressOffset>0xe4</addressOffset>
                    <description>DPORT_CPU_INTR_FROM_CPU_2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CPU_INTR_FROM_CPU_2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CPU_INTR_FROM_CPU_3</name>
                    <addressOffset>0xe8</addressOffset>
                    <description>DPORT_CPU_INTR_FROM_CPU_3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CPU_INTR_FROM_CPU_3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_INTR_STATUS_0</name>
                    <addressOffset>0xec</addressOffset>
                    <description>DPORT_PRO_INTR_STATUS_0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_INTR_STATUS_0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_INTR_STATUS_1</name>
                    <addressOffset>0xf0</addressOffset>
                    <description>DPORT_PRO_INTR_STATUS_1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_INTR_STATUS_1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_INTR_STATUS_2</name>
                    <addressOffset>0xf4</addressOffset>
                    <description>DPORT_PRO_INTR_STATUS_2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_INTR_STATUS_2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_INTR_STATUS_0</name>
                    <addressOffset>0xf8</addressOffset>
                    <description>DPORT_APP_INTR_STATUS_0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_INTR_STATUS_0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_INTR_STATUS_1</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>DPORT_APP_INTR_STATUS_1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_INTR_STATUS_1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_INTR_STATUS_2</name>
                    <addressOffset>0x100</addressOffset>
                    <description>DPORT_APP_INTR_STATUS_2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_INTR_STATUS_2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_MAC_INTR_MAP</name>
                    <addressOffset>0x104</addressOffset>
                    <description>DPORT_PRO_MAC_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_MAC_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_MAC_NMI_MAP</name>
                    <addressOffset>0x108</addressOffset>
                    <description>DPORT_PRO_MAC_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_MAC_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_BB_INT_MAP</name>
                    <addressOffset>0x10c</addressOffset>
                    <description>DPORT_PRO_BB_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_BB_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_BT_MAC_INT_MAP</name>
                    <addressOffset>0x110</addressOffset>
                    <description>DPORT_PRO_BT_MAC_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_BT_MAC_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_BT_BB_INT_MAP</name>
                    <addressOffset>0x114</addressOffset>
                    <description>DPORT_PRO_BT_BB_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_BT_BB_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_BT_BB_NMI_MAP</name>
                    <addressOffset>0x118</addressOffset>
                    <description>DPORT_PRO_BT_BB_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_BT_BB_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_RWBT_IRQ_MAP</name>
                    <addressOffset>0x11c</addressOffset>
                    <description>DPORT_PRO_RWBT_IRQ_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RWBT_IRQ_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_RWBLE_IRQ_MAP</name>
                    <addressOffset>0x120</addressOffset>
                    <description>DPORT_PRO_RWBLE_IRQ_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RWBLE_IRQ_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_RWBT_NMI_MAP</name>
                    <addressOffset>0x124</addressOffset>
                    <description>DPORT_PRO_RWBT_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RWBT_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_RWBLE_NMI_MAP</name>
                    <addressOffset>0x128</addressOffset>
                    <description>DPORT_PRO_RWBLE_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RWBLE_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
