nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_PRO_SLC0_INTR_MAP</name>
                    <addressOffset>0x12c</addressOffset>
                    <description>DPORT_PRO_SLC0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SLC0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SLC1_INTR_MAP</name>
                    <addressOffset>0x130</addressOffset>
                    <description>DPORT_PRO_SLC1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SLC1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_UHCI0_INTR_MAP</name>
                    <addressOffset>0x134</addressOffset>
                    <description>DPORT_PRO_UHCI0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_UHCI0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_UHCI1_INTR_MAP</name>
                    <addressOffset>0x138</addressOffset>
                    <description>DPORT_PRO_UHCI1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_UHCI1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_T0_LEVEL_INT_MAP</name>
                    <addressOffset>0x13c</addressOffset>
                    <description>DPORT_PRO_TG_T0_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_T0_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_T1_LEVEL_INT_MAP</name>
                    <addressOffset>0x140</addressOffset>
                    <description>DPORT_PRO_TG_T1_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_T1_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_WDT_LEVEL_INT_MAP</name>
                    <addressOffset>0x144</addressOffset>
                    <description>DPORT_PRO_TG_WDT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_WDT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_LACT_LEVEL_INT_MAP</name>
                    <addressOffset>0x148</addressOffset>
                    <description>DPORT_PRO_TG_LACT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_LACT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_T0_LEVEL_INT_MAP</name>
                    <addressOffset>0x14c</addressOffset>
                    <description>DPORT_PRO_TG1_T0_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_T0_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_T1_LEVEL_INT_MAP</name>
                    <addressOffset>0x150</addressOffset>
                    <description>DPORT_PRO_TG1_T1_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_T1_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_WDT_LEVEL_INT_MAP</name>
                    <addressOffset>0x154</addressOffset>
                    <description>DPORT_PRO_TG1_WDT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_WDT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_LACT_LEVEL_INT_MAP</name>
                    <addressOffset>0x158</addressOffset>
                    <description>DPORT_PRO_TG1_LACT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_LACT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_GPIO_INTERRUPT_MAP</name>
                    <addressOffset>0x15c</addressOffset>
                    <description>DPORT_PRO_GPIO_INTERRUPT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_GPIO_INTERRUPT_PRO_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_GPIO_INTERRUPT_NMI_MAP</name>
                    <addressOffset>0x160</addressOffset>
                    <description>DPORT_PRO_GPIO_INTERRUPT_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_INTR_FROM_CPU_0_MAP</name>
                    <addressOffset>0x164</addressOffset>
                    <description>DPORT_PRO_CPU_INTR_FROM_CPU_0_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CPU_INTR_FROM_CPU_0_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_INTR_FROM_CPU_1_MAP</name>
                    <addressOffset>0x168</addressOffset>
                    <description>DPORT_PRO_CPU_INTR_FROM_CPU_1_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CPU_INTR_FROM_CPU_1_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_INTR_FROM_CPU_2_MAP</name>
                    <addressOffset>0x16c</addressOffset>
                    <description>DPORT_PRO_CPU_INTR_FROM_CPU_2_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CPU_INTR_FROM_CPU_2_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_INTR_FROM_CPU_3_MAP</name>
                    <addressOffset>0x170</addressOffset>
                    <description>DPORT_PRO_CPU_INTR_FROM_CPU_3_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CPU_INTR_FROM_CPU_3_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SPI_INTR_0_MAP</name>
                    <addressOffset>0x174</addressOffset>
                    <description>DPORT_PRO_SPI_INTR_0_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SPI_INTR_0_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SPI_INTR_1_MAP</name>
                    <addressOffset>0x178</addressOffset>
                    <description>DPORT_PRO_SPI_INTR_1_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SPI_INTR_1_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SPI_INTR_2_MAP</name>
                    <addressOffset>0x17c</addressOffset>
                    <description>DPORT_PRO_SPI_INTR_2_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SPI_INTR_2_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SPI_INTR_3_MAP</name>
                    <addressOffset>0x180</addressOffset>
                    <description>DPORT_PRO_SPI_INTR_3_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SPI_INTR_3_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_I2S0_INT_MAP</name>
                    <addressOffset>0x184</addressOffset>
                    <description>DPORT_PRO_I2S0_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_I2S0_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_I2S1_INT_MAP</name>
                    <addressOffset>0x188</addressOffset>
                    <description>DPORT_PRO_I2S1_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_I2S1_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_UART_INTR_MAP</name>
                    <addressOffset>0x18c</addressOffset>
                    <description>DPORT_PRO_UART_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_UART_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_UART1_INTR_MAP</name>
                    <addressOffset>0x190</addressOffset>
                    <description>DPORT_PRO_UART1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_UART1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_UART2_INTR_MAP</name>
                    <addressOffset>0x194</addressOffset>
                    <description>DPORT_PRO_UART2_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_UART2_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SDIO_HOST_INTERRUPT_MAP</name>
                    <addressOffset>0x198</addressOffset>
                    <description>DPORT_PRO_SDIO_HOST_INTERRUPT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SDIO_HOST_INTERRUPT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_EMAC_INT_MAP</name>
                    <addressOffset>0x19c</addressOffset>
                    <description>DPORT_PRO_EMAC_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_EMAC_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_PWM0_INTR_MAP</name>
                    <addressOffset>0x1a0</addressOffset>
                    <description>DPORT_PRO_PWM0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_PWM0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_PWM1_INTR_MAP</name>
                    <addressOffset>0x1a4</addressOffset>
                    <description>DPORT_PRO_PWM1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_PWM1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_PWM2_INTR_MAP</name>
                    <addressOffset>0x1a8</addressOffset>
                    <description>DPORT_PRO_PWM2_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_PWM2_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_PWM3_INTR_MAP</name>
                    <addressOffset>0x1ac</addressOffset>
                    <description>DPORT_PRO_PWM3_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_PWM3_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_LEDC_INT_MAP</name>
                    <addressOffset>0x1b0</addressOffset>
                    <description>DPORT_PRO_LEDC_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_LEDC_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_EFUSE_INT_MAP</name>
                    <addressOffset>0x1b4</addressOffset>
                    <description>DPORT_PRO_EFUSE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_EFUSE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CAN_INT_MAP</name>
                    <addressOffset>0x1b8</addressOffset>
                    <description>DPORT_PRO_CAN_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CAN_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_RTC_CORE_INTR_MAP</name>
                    <addressOffset>0x1bc</addressOffset>
                    <description>DPORT_PRO_RTC_CORE_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RTC_CORE_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
