nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_PRO_RMT_INTR_MAP</name>
                    <addressOffset>0x1c0</addressOffset>
                    <description>DPORT_PRO_RMT_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RMT_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_PCNT_INTR_MAP</name>
                    <addressOffset>0x1c4</addressOffset>
                    <description>DPORT_PRO_PCNT_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_PCNT_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_I2C_EXT0_INTR_MAP</name>
                    <addressOffset>0x1c8</addressOffset>
                    <description>DPORT_PRO_I2C_EXT0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_I2C_EXT0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_I2C_EXT1_INTR_MAP</name>
                    <addressOffset>0x1cc</addressOffset>
                    <description>DPORT_PRO_I2C_EXT1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_I2C_EXT1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_RSA_INTR_MAP</name>
                    <addressOffset>0x1d0</addressOffset>
                    <description>DPORT_PRO_RSA_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RSA_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SPI1_DMA_INT_MAP</name>
                    <addressOffset>0x1d4</addressOffset>
                    <description>DPORT_PRO_SPI1_DMA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SPI1_DMA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SPI2_DMA_INT_MAP</name>
                    <addressOffset>0x1d8</addressOffset>
                    <description>DPORT_PRO_SPI2_DMA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SPI2_DMA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_SPI3_DMA_INT_MAP</name>
                    <addressOffset>0x1dc</addressOffset>
                    <description>DPORT_PRO_SPI3_DMA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_SPI3_DMA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_WDG_INT_MAP</name>
                    <addressOffset>0x1e0</addressOffset>
                    <description>DPORT_PRO_WDG_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_WDG_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TIMER_INT1_MAP</name>
                    <addressOffset>0x1e4</addressOffset>
                    <description>DPORT_PRO_TIMER_INT1_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TIMER_INT1_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TIMER_INT2_MAP</name>
                    <addressOffset>0x1e8</addressOffset>
                    <description>DPORT_PRO_TIMER_INT2_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TIMER_INT2_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_T0_EDGE_INT_MAP</name>
                    <addressOffset>0x1ec</addressOffset>
                    <description>DPORT_PRO_TG_T0_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_T0_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_T1_EDGE_INT_MAP</name>
                    <addressOffset>0x1f0</addressOffset>
                    <description>DPORT_PRO_TG_T1_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_T1_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_WDT_EDGE_INT_MAP</name>
                    <addressOffset>0x1f4</addressOffset>
                    <description>DPORT_PRO_TG_WDT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_WDT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG_LACT_EDGE_INT_MAP</name>
                    <addressOffset>0x1f8</addressOffset>
                    <description>DPORT_PRO_TG_LACT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG_LACT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_T0_EDGE_INT_MAP</name>
                    <addressOffset>0x1fc</addressOffset>
                    <description>DPORT_PRO_TG1_T0_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_T0_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_T1_EDGE_INT_MAP</name>
                    <addressOffset>0x200</addressOffset>
                    <description>DPORT_PRO_TG1_T1_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_T1_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_WDT_EDGE_INT_MAP</name>
                    <addressOffset>0x204</addressOffset>
                    <description>DPORT_PRO_TG1_WDT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_WDT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_TG1_LACT_EDGE_INT_MAP</name>
                    <addressOffset>0x208</addressOffset>
                    <description>DPORT_PRO_TG1_LACT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_TG1_LACT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_MMU_IA_INT_MAP</name>
                    <addressOffset>0x20c</addressOffset>
                    <description>DPORT_PRO_MMU_IA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_MMU_IA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_MPU_IA_INT_MAP</name>
                    <addressOffset>0x210</addressOffset>
                    <description>DPORT_PRO_MPU_IA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_MPU_IA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CACHE_IA_INT_MAP</name>
                    <addressOffset>0x214</addressOffset>
                    <description>DPORT_PRO_CACHE_IA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_IA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_MAC_INTR_MAP</name>
                    <addressOffset>0x218</addressOffset>
                    <description>DPORT_APP_MAC_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_MAC_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_MAC_NMI_MAP</name>
                    <addressOffset>0x21c</addressOffset>
                    <description>DPORT_APP_MAC_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_MAC_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_BB_INT_MAP</name>
                    <addressOffset>0x220</addressOffset>
                    <description>DPORT_APP_BB_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_BB_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_BT_MAC_INT_MAP</name>
                    <addressOffset>0x224</addressOffset>
                    <description>DPORT_APP_BT_MAC_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_BT_MAC_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_BT_BB_INT_MAP</name>
                    <addressOffset>0x228</addressOffset>
                    <description>DPORT_APP_BT_BB_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_BT_BB_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_BT_BB_NMI_MAP</name>
                    <addressOffset>0x22c</addressOffset>
                    <description>DPORT_APP_BT_BB_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_BT_BB_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_RWBT_IRQ_MAP</name>
                    <addressOffset>0x230</addressOffset>
                    <description>DPORT_APP_RWBT_IRQ_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RWBT_IRQ_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_RWBLE_IRQ_MAP</name>
                    <addressOffset>0x234</addressOffset>
                    <description>DPORT_APP_RWBLE_IRQ_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RWBLE_IRQ_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_RWBT_NMI_MAP</name>
                    <addressOffset>0x238</addressOffset>
                    <description>DPORT_APP_RWBT_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RWBT_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_RWBLE_NMI_MAP</name>
                    <addressOffset>0x23c</addressOffset>
                    <description>DPORT_APP_RWBLE_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RWBLE_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SLC0_INTR_MAP</name>
                    <addressOffset>0x240</addressOffset>
                    <description>DPORT_APP_SLC0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SLC0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SLC1_INTR_MAP</name>
                    <addressOffset>0x244</addressOffset>
                    <description>DPORT_APP_SLC1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SLC1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_UHCI0_INTR_MAP</name>
                    <addressOffset>0x248</addressOffset>
                    <description>DPORT_APP_UHCI0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_UHCI0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_UHCI1_INTR_MAP</name>
                    <addressOffset>0x24c</addressOffset>
                    <description>DPORT_APP_UHCI1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_UHCI1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG_T0_LEVEL_INT_MAP</name>
                    <addressOffset>0x250</addressOffset>
                    <description>DPORT_APP_TG_T0_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_T0_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG_T1_LEVEL_INT_MAP</name>
                    <addressOffset>0x254</addressOffset>
                    <description>DPORT_APP_TG_T1_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_T1_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
