nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_APP_TG_WDT_LEVEL_INT_MAP</name>
                    <addressOffset>0x258</addressOffset>
                    <description>DPORT_APP_TG_WDT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_WDT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG_LACT_LEVEL_INT_MAP</name>
                    <addressOffset>0x25c</addressOffset>
                    <description>DPORT_APP_TG_LACT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_LACT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_T0_LEVEL_INT_MAP</name>
                    <addressOffset>0x260</addressOffset>
                    <description>DPORT_APP_TG1_T0_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_T0_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_T1_LEVEL_INT_MAP</name>
                    <addressOffset>0x264</addressOffset>
                    <description>DPORT_APP_TG1_T1_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_T1_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_WDT_LEVEL_INT_MAP</name>
                    <addressOffset>0x268</addressOffset>
                    <description>DPORT_APP_TG1_WDT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_WDT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_LACT_LEVEL_INT_MAP</name>
                    <addressOffset>0x26c</addressOffset>
                    <description>DPORT_APP_TG1_LACT_LEVEL_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_LACT_LEVEL_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_GPIO_INTERRUPT_MAP</name>
                    <addressOffset>0x270</addressOffset>
                    <description>DPORT_APP_GPIO_INTERRUPT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_GPIO_INTERRUPT_APP_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_GPIO_INTERRUPT_NMI_MAP</name>
                    <addressOffset>0x274</addressOffset>
                    <description>DPORT_APP_GPIO_INTERRUPT_NMI_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_INTR_FROM_CPU_0_MAP</name>
                    <addressOffset>0x278</addressOffset>
                    <description>DPORT_APP_CPU_INTR_FROM_CPU_0_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CPU_INTR_FROM_CPU_0_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_INTR_FROM_CPU_1_MAP</name>
                    <addressOffset>0x27c</addressOffset>
                    <description>DPORT_APP_CPU_INTR_FROM_CPU_1_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CPU_INTR_FROM_CPU_1_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_INTR_FROM_CPU_2_MAP</name>
                    <addressOffset>0x280</addressOffset>
                    <description>DPORT_APP_CPU_INTR_FROM_CPU_2_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CPU_INTR_FROM_CPU_2_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_INTR_FROM_CPU_3_MAP</name>
                    <addressOffset>0x284</addressOffset>
                    <description>DPORT_APP_CPU_INTR_FROM_CPU_3_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CPU_INTR_FROM_CPU_3_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SPI_INTR_0_MAP</name>
                    <addressOffset>0x288</addressOffset>
                    <description>DPORT_APP_SPI_INTR_0_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SPI_INTR_0_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SPI_INTR_1_MAP</name>
                    <addressOffset>0x28c</addressOffset>
                    <description>DPORT_APP_SPI_INTR_1_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SPI_INTR_1_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SPI_INTR_2_MAP</name>
                    <addressOffset>0x290</addressOffset>
                    <description>DPORT_APP_SPI_INTR_2_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SPI_INTR_2_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SPI_INTR_3_MAP</name>
                    <addressOffset>0x294</addressOffset>
                    <description>DPORT_APP_SPI_INTR_3_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SPI_INTR_3_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_I2S0_INT_MAP</name>
                    <addressOffset>0x298</addressOffset>
                    <description>DPORT_APP_I2S0_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_I2S0_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_I2S1_INT_MAP</name>
                    <addressOffset>0x29c</addressOffset>
                    <description>DPORT_APP_I2S1_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_I2S1_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_UART_INTR_MAP</name>
                    <addressOffset>0x2a0</addressOffset>
                    <description>DPORT_APP_UART_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_UART_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_UART1_INTR_MAP</name>
                    <addressOffset>0x2a4</addressOffset>
                    <description>DPORT_APP_UART1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_UART1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_UART2_INTR_MAP</name>
                    <addressOffset>0x2a8</addressOffset>
                    <description>DPORT_APP_UART2_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_UART2_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SDIO_HOST_INTERRUPT_MAP</name>
                    <addressOffset>0x2ac</addressOffset>
                    <description>DPORT_APP_SDIO_HOST_INTERRUPT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SDIO_HOST_INTERRUPT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_EMAC_INT_MAP</name>
                    <addressOffset>0x2b0</addressOffset>
                    <description>DPORT_APP_EMAC_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_EMAC_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_PWM0_INTR_MAP</name>
                    <addressOffset>0x2b4</addressOffset>
                    <description>DPORT_APP_PWM0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_PWM0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_PWM1_INTR_MAP</name>
                    <addressOffset>0x2b8</addressOffset>
                    <description>DPORT_APP_PWM1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_PWM1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_PWM2_INTR_MAP</name>
                    <addressOffset>0x2bc</addressOffset>
                    <description>DPORT_APP_PWM2_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_PWM2_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_PWM3_INTR_MAP</name>
                    <addressOffset>0x2c0</addressOffset>
                    <description>DPORT_APP_PWM3_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_PWM3_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_LEDC_INT_MAP</name>
                    <addressOffset>0x2c4</addressOffset>
                    <description>DPORT_APP_LEDC_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_LEDC_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_EFUSE_INT_MAP</name>
                    <addressOffset>0x2c8</addressOffset>
                    <description>DPORT_APP_EFUSE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_EFUSE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CAN_INT_MAP</name>
                    <addressOffset>0x2cc</addressOffset>
                    <description>DPORT_APP_CAN_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CAN_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_RTC_CORE_INTR_MAP</name>
                    <addressOffset>0x2d0</addressOffset>
                    <description>DPORT_APP_RTC_CORE_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RTC_CORE_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_RMT_INTR_MAP</name>
                    <addressOffset>0x2d4</addressOffset>
                    <description>DPORT_APP_RMT_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RMT_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_PCNT_INTR_MAP</name>
                    <addressOffset>0x2d8</addressOffset>
                    <description>DPORT_APP_PCNT_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_PCNT_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_I2C_EXT0_INTR_MAP</name>
                    <addressOffset>0x2dc</addressOffset>
                    <description>DPORT_APP_I2C_EXT0_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_I2C_EXT0_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_I2C_EXT1_INTR_MAP</name>
                    <addressOffset>0x2e0</addressOffset>
                    <description>DPORT_APP_I2C_EXT1_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_I2C_EXT1_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_RSA_INTR_MAP</name>
                    <addressOffset>0x2e4</addressOffset>
                    <description>DPORT_APP_RSA_INTR_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RSA_INTR_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SPI1_DMA_INT_MAP</name>
                    <addressOffset>0x2e8</addressOffset>
                    <description>DPORT_APP_SPI1_DMA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SPI1_DMA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
