nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_APP_SPI2_DMA_INT_MAP</name>
                    <addressOffset>0x2ec</addressOffset>
                    <description>DPORT_APP_SPI2_DMA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SPI2_DMA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_SPI3_DMA_INT_MAP</name>
                    <addressOffset>0x2f0</addressOffset>
                    <description>DPORT_APP_SPI3_DMA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_SPI3_DMA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_WDG_INT_MAP</name>
                    <addressOffset>0x2f4</addressOffset>
                    <description>DPORT_APP_WDG_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_WDG_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TIMER_INT1_MAP</name>
                    <addressOffset>0x2f8</addressOffset>
                    <description>DPORT_APP_TIMER_INT1_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TIMER_INT1_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TIMER_INT2_MAP</name>
                    <addressOffset>0x2fc</addressOffset>
                    <description>DPORT_APP_TIMER_INT2_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TIMER_INT2_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG_T0_EDGE_INT_MAP</name>
                    <addressOffset>0x300</addressOffset>
                    <description>DPORT_APP_TG_T0_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_T0_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG_T1_EDGE_INT_MAP</name>
                    <addressOffset>0x304</addressOffset>
                    <description>DPORT_APP_TG_T1_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_T1_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG_WDT_EDGE_INT_MAP</name>
                    <addressOffset>0x308</addressOffset>
                    <description>DPORT_APP_TG_WDT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_WDT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG_LACT_EDGE_INT_MAP</name>
                    <addressOffset>0x30c</addressOffset>
                    <description>DPORT_APP_TG_LACT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG_LACT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_T0_EDGE_INT_MAP</name>
                    <addressOffset>0x310</addressOffset>
                    <description>DPORT_APP_TG1_T0_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_T0_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_T1_EDGE_INT_MAP</name>
                    <addressOffset>0x314</addressOffset>
                    <description>DPORT_APP_TG1_T1_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_T1_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_WDT_EDGE_INT_MAP</name>
                    <addressOffset>0x318</addressOffset>
                    <description>DPORT_APP_TG1_WDT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_WDT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_TG1_LACT_EDGE_INT_MAP</name>
                    <addressOffset>0x31c</addressOffset>
                    <description>DPORT_APP_TG1_LACT_EDGE_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_TG1_LACT_EDGE_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_MMU_IA_INT_MAP</name>
                    <addressOffset>0x320</addressOffset>
                    <description>DPORT_APP_MMU_IA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_MMU_IA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_MPU_IA_INT_MAP</name>
                    <addressOffset>0x324</addressOffset>
                    <description>DPORT_APP_MPU_IA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_MPU_IA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CACHE_IA_INT_MAP</name>
                    <addressOffset>0x328</addressOffset>
                    <description>DPORT_APP_CACHE_IA_INT_MAP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_IA_INT_MAP</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_UART</name>
                    <addressOffset>0x32c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_UART</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_UART_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SPI1</name>
                    <addressOffset>0x330</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SPI1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SPI1_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SPI0</name>
                    <addressOffset>0x334</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SPI0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SPI0_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_GPIO</name>
                    <addressOffset>0x338</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_GPIO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_GPIO_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_FE2</name>
                    <addressOffset>0x33c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_FE2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_FE2_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_FE</name>
                    <addressOffset>0x340</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_FE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_FE_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_TIMER</name>
                    <addressOffset>0x344</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_TIMER</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_TIMER_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_RTC</name>
                    <addressOffset>0x348</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_RTC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RTC_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_IO_MUX</name>
                    <addressOffset>0x34c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_IO_MUX</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IOMUX_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_WDG</name>
                    <addressOffset>0x350</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_WDG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_WDG_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_HINF</name>
                    <addressOffset>0x354</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_HINF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_HINF_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_UHCI1</name>
                    <addressOffset>0x358</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_UHCI1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_UHCI1_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_MISC</name>
                    <addressOffset>0x35c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_MISC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_MISC_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_I2C</name>
                    <addressOffset>0x360</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_I2C</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_I2C_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_I2S0</name>
                    <addressOffset>0x364</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_I2S0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_I2S0_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_UART1</name>
                    <addressOffset>0x368</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_UART1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_UART1_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_BT</name>
                    <addressOffset>0x36c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_BT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_BT_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_BT_BUFFER</name>
                    <addressOffset>0x370</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_BT_BUFFER</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_BTBUFFER_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_I2C_EXT0</name>
                    <addressOffset>0x374</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_I2C_EXT0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_I2CEXT0_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_UHCI0</name>
                    <addressOffset>0x378</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_UHCI0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_UHCI0_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SLCHOST</name>
                    <addressOffset>0x37c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SLCHOST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SLCHOST_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
