nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_RMT</name>
                    <addressOffset>0x380</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_RMT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RMT_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_PCNT</name>
                    <addressOffset>0x384</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_PCNT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PCNT_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SLC</name>
                    <addressOffset>0x388</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SLC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SLC_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_LEDC</name>
                    <addressOffset>0x38c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_LEDC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_LEDC_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_EFUSE</name>
                    <addressOffset>0x390</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_EFUSE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_EFUSE_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SPI_ENCRYPT</name>
                    <addressOffset>0x394</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SPI_ENCRYPT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SPI_ENCRYPY_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_BB</name>
                    <addressOffset>0x398</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_BB</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_BB_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_PWM0</name>
                    <addressOffset>0x39c</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_PWM0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PWM0_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_TIMERGROUP</name>
                    <addressOffset>0x3a0</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_TIMERGROUP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_TIMERGROUP_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_TIMERGROUP1</name>
                    <addressOffset>0x3a4</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_TIMERGROUP1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_TIMERGROUP1_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SPI2</name>
                    <addressOffset>0x3a8</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SPI2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SPI2_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SPI3</name>
                    <addressOffset>0x3ac</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SPI3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SPI3_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_APB_CTRL</name>
                    <addressOffset>0x3b0</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_APB_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APBCTRL_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_I2C_EXT1</name>
                    <addressOffset>0x3b4</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_I2C_EXT1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_I2CEXT1_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_SDIO_HOST</name>
                    <addressOffset>0x3b8</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_SDIO_HOST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SDIOHOST_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_EMAC</name>
                    <addressOffset>0x3bc</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_EMAC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_EMAC_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_CAN</name>
                    <addressOffset>0x3c0</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_CAN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CAN_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_PWM1</name>
                    <addressOffset>0x3c4</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_PWM1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PWM1_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_I2S1</name>
                    <addressOffset>0x3c8</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_I2S1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_I2S1_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_UART2</name>
                    <addressOffset>0x3cc</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_UART2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_UART2_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_PWM2</name>
                    <addressOffset>0x3d0</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_PWM2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PWM2_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_PWM3</name>
                    <addressOffset>0x3d4</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_PWM3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PWM3_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_RWBT</name>
                    <addressOffset>0x3d8</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_RWBT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RWBT_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_BTMAC</name>
                    <addressOffset>0x3dc</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_BTMAC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_BTMAC_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_WIFIMAC</name>
                    <addressOffset>0x3e0</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_WIFIMAC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_WIFIMAC_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_AHBLITE_MPU_TABLE_PWR</name>
                    <addressOffset>0x3e4</addressOffset>
                    <description>DPORT_AHBLITE_MPU_TABLE_PWR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PWR_ACCESS_GRANT_CONFIG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_MEM_ACCESS_DBUG0</name>
                    <addressOffset>0x3e8</addressOffset>
                    <description>DPORT_MEM_ACCESS_DBUG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_INTERNAL_SRAM_MMU_MULTI_HIT</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_INTERNAL_SRAM_IA</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_INTERNAL_SRAM_MMU_AD</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SHARE_ROM_IA</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SHARE_ROM_MPU_AD</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_ROM_IA</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_ROM_MPU_AD</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_ROM_IA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_ROM_MPU_AD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_MEM_ACCESS_DBUG1</name>
                    <addressOffset>0x3ec</addressOffset>
                    <description>DPORT_MEM_ACCESS_DBUG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_AHBLITE_IA</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHBLITE_ACCESS_DENY</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AHB_ACCESS_DENY</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PIDGEN_IA</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_ARB_IA</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_INTERNAL_SRAM_MMU_MISS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG0</name>
                    <addressOffset>0x3f0</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_RX_END</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_SLAVE_WDATA_V</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_SLAVE_WR</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_TX_END</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_WR_BAK_TO_READ</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_STATE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_IA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CACHE_MMU_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG1</name>
                    <addressOffset>0x3f4</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CTAG_RAM_RDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
