nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG2</name>
                    <addressOffset>0x3f8</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_VADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>27</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG3</name>
                    <addressOffset>0x3fc</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CACHE_IRAM0_PID_ERROR</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CPU_DISABLED_CACHE_IA</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG4</name>
                    <addressOffset>0x400</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_DRAM1ADDR0_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG5</name>
                    <addressOffset>0x404</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_DROM0ADDR0_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG6</name>
                    <addressOffset>0x408</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_IRAM0ADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG7</name>
                    <addressOffset>0x40c</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_IRAM1ADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG8</name>
                    <addressOffset>0x410</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_IROM0ADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_DCACHE_DBUG9</name>
                    <addressOffset>0x414</addressOffset>
                    <description>DPORT_PRO_DCACHE_DBUG9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_OPSDRAMADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG0</name>
                    <addressOffset>0x418</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_RX_END</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_SLAVE_WDATA_V</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_SLAVE_WR</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_TX_END</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_WR_BAK_TO_READ</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_STATE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_IA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CACHE_MMU_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG1</name>
                    <addressOffset>0x41c</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CTAG_RAM_RDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG2</name>
                    <addressOffset>0x420</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_VADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>27</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG3</name>
                    <addressOffset>0x424</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CACHE_IRAM0_PID_ERROR</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CPU_DISABLED_CACHE_IA</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG4</name>
                    <addressOffset>0x428</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_DRAM1ADDR0_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG5</name>
                    <addressOffset>0x42c</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_DROM0ADDR0_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG6</name>
                    <addressOffset>0x430</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_IRAM0ADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG7</name>
                    <addressOffset>0x434</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_IRAM1ADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG8</name>
                    <addressOffset>0x438</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_IROM0ADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_DCACHE_DBUG9</name>
                    <addressOffset>0x43c</addressOffset>
                    <description>DPORT_APP_DCACHE_DBUG9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_OPSDRAMADDR_IA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_CTRL</name>
                    <addressOffset>0x440</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CPU_PDEBUG_ENABLE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CPU_RECORD_DISABLE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PRO_CPU_RECORD_ENABLE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_STATUS</name>
                    <addressOffset>0x444</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_CPU_RECORDING</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PID</name>
                    <addressOffset>0x448</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PID</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PID</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PDEBUGINST</name>
                    <addressOffset>0x44c</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PDEBUGINST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PDEBUGINST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PDEBUGSTATUS</name>
                    <addressOffset>0x450</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PDEBUGSTATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PDEBUGSTATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PDEBUGDATA</name>
                    <addressOffset>0x454</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PDEBUGDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PDEBUGDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PDEBUGPC</name>
                    <addressOffset>0x458</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PDEBUGPC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PDEBUGPC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PDEBUGLS0STAT</name>
                    <addressOffset>0x45c</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PDEBUGLS0STAT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PDEBUGLS0STAT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PDEBUGLS0ADDR</name>
                    <addressOffset>0x460</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PDEBUGLS0ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PDEBUGLS0ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_CPU_RECORD_PDEBUGLS0DATA</name>
                    <addressOffset>0x464</addressOffset>
                    <description>DPORT_PRO_CPU_RECORD_PDEBUGLS0DATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_PRO_PDEBUGLS0DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_CTRL</name>
                    <addressOffset>0x468</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CPU_PDEBUG_ENABLE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CPU_RECORD_DISABLE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_APP_CPU_RECORD_ENABLE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_STATUS</name>
                    <addressOffset>0x46c</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_CPU_RECORDING</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_PID</name>
                    <addressOffset>0x470</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PID</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PID</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_PDEBUGINST</name>
                    <addressOffset>0x474</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PDEBUGINST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PDEBUGINST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_PDEBUGSTATUS</name>
                    <addressOffset>0x478</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PDEBUGSTATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PDEBUGSTATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
