nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_APP_CPU_RECORD_PDEBUGDATA</name>
                    <addressOffset>0x47c</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PDEBUGDATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PDEBUGDATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_PDEBUGPC</name>
                    <addressOffset>0x480</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PDEBUGPC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PDEBUGPC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_PDEBUGLS0STAT</name>
                    <addressOffset>0x484</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PDEBUGLS0STAT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PDEBUGLS0STAT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_PDEBUGLS0ADDR</name>
                    <addressOffset>0x488</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PDEBUGLS0ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PDEBUGLS0ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_CPU_RECORD_PDEBUGLS0DATA</name>
                    <addressOffset>0x48c</addressOffset>
                    <description>DPORT_APP_CPU_RECORD_PDEBUGLS0DATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RECORD_APP_PDEBUGLS0DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_RSA_PD_CTRL</name>
                    <addressOffset>0x490</addressOffset>
                    <description>DPORT_RSA_PD_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_RSA_PD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ROM_MPU_TABLE0</name>
                    <addressOffset>0x494</addressOffset>
                    <description>DPORT_ROM_MPU_TABLE0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_ROM_MPU_TABLE0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ROM_MPU_TABLE1</name>
                    <addressOffset>0x498</addressOffset>
                    <description>DPORT_ROM_MPU_TABLE1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_ROM_MPU_TABLE1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ROM_MPU_TABLE2</name>
                    <addressOffset>0x49c</addressOffset>
                    <description>DPORT_ROM_MPU_TABLE2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_ROM_MPU_TABLE2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_ROM_MPU_TABLE3</name>
                    <addressOffset>0x4a0</addressOffset>
                    <description>DPORT_ROM_MPU_TABLE3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_ROM_MPU_TABLE3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE0</name>
                    <addressOffset>0x4a4</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE1</name>
                    <addressOffset>0x4a8</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE2</name>
                    <addressOffset>0x4ac</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE3</name>
                    <addressOffset>0x4b0</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE4</name>
                    <addressOffset>0x4b4</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE5</name>
                    <addressOffset>0x4b8</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE6</name>
                    <addressOffset>0x4bc</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE7</name>
                    <addressOffset>0x4c0</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE8</name>
                    <addressOffset>0x4c4</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE8</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE9</name>
                    <addressOffset>0x4c8</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE9</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE10</name>
                    <addressOffset>0x4cc</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE10</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE10</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE11</name>
                    <addressOffset>0x4d0</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE11</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE11</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE12</name>
                    <addressOffset>0x4d4</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE12</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE12</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE13</name>
                    <addressOffset>0x4d8</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE13</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE13</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE14</name>
                    <addressOffset>0x4dc</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE14</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE14</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE15</name>
                    <addressOffset>0x4e0</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE15</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE15</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE16</name>
                    <addressOffset>0x4e4</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE16</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE16</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE17</name>
                    <addressOffset>0x4e8</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE17</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE17</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE18</name>
                    <addressOffset>0x4ec</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE18</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE18</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE19</name>
                    <addressOffset>0x4f0</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE19</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE19</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE20</name>
                    <addressOffset>0x4f4</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE20</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE20</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE21</name>
                    <addressOffset>0x4f8</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE21</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE21</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE22</name>
                    <addressOffset>0x4fc</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE22</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE22</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SHROM_MPU_TABLE23</name>
                    <addressOffset>0x500</addressOffset>
                    <description>DPORT_SHROM_MPU_TABLE23</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SHROM_MPU_TABLE23</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE0</name>
                    <addressOffset>0x504</addressOffset>
                    <description>DPORT_IMMU_TABLE0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE1</name>
                    <addressOffset>0x508</addressOffset>
                    <description>DPORT_IMMU_TABLE1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE2</name>
                    <addressOffset>0x50c</addressOffset>
                    <description>DPORT_IMMU_TABLE2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE3</name>
                    <addressOffset>0x510</addressOffset>
                    <description>DPORT_IMMU_TABLE3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
