nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_IMMU_TABLE4</name>
                    <addressOffset>0x514</addressOffset>
                    <description>DPORT_IMMU_TABLE4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE5</name>
                    <addressOffset>0x518</addressOffset>
                    <description>DPORT_IMMU_TABLE5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE6</name>
                    <addressOffset>0x51c</addressOffset>
                    <description>DPORT_IMMU_TABLE6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE7</name>
                    <addressOffset>0x520</addressOffset>
                    <description>DPORT_IMMU_TABLE7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE8</name>
                    <addressOffset>0x524</addressOffset>
                    <description>DPORT_IMMU_TABLE8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE8</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE9</name>
                    <addressOffset>0x528</addressOffset>
                    <description>DPORT_IMMU_TABLE9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE9</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE10</name>
                    <addressOffset>0x52c</addressOffset>
                    <description>DPORT_IMMU_TABLE10</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE10</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE11</name>
                    <addressOffset>0x530</addressOffset>
                    <description>DPORT_IMMU_TABLE11</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE11</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE12</name>
                    <addressOffset>0x534</addressOffset>
                    <description>DPORT_IMMU_TABLE12</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE12</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE13</name>
                    <addressOffset>0x538</addressOffset>
                    <description>DPORT_IMMU_TABLE13</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE13</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE14</name>
                    <addressOffset>0x53c</addressOffset>
                    <description>DPORT_IMMU_TABLE14</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE14</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_IMMU_TABLE15</name>
                    <addressOffset>0x540</addressOffset>
                    <description>DPORT_IMMU_TABLE15</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_IMMU_TABLE15</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE0</name>
                    <addressOffset>0x544</addressOffset>
                    <description>DPORT_DMMU_TABLE0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE1</name>
                    <addressOffset>0x548</addressOffset>
                    <description>DPORT_DMMU_TABLE1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE2</name>
                    <addressOffset>0x54c</addressOffset>
                    <description>DPORT_DMMU_TABLE2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE3</name>
                    <addressOffset>0x550</addressOffset>
                    <description>DPORT_DMMU_TABLE3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE4</name>
                    <addressOffset>0x554</addressOffset>
                    <description>DPORT_DMMU_TABLE4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE5</name>
                    <addressOffset>0x558</addressOffset>
                    <description>DPORT_DMMU_TABLE5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE6</name>
                    <addressOffset>0x55c</addressOffset>
                    <description>DPORT_DMMU_TABLE6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE7</name>
                    <addressOffset>0x560</addressOffset>
                    <description>DPORT_DMMU_TABLE7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE8</name>
                    <addressOffset>0x564</addressOffset>
                    <description>DPORT_DMMU_TABLE8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE8</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE9</name>
                    <addressOffset>0x568</addressOffset>
                    <description>DPORT_DMMU_TABLE9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE9</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE10</name>
                    <addressOffset>0x56c</addressOffset>
                    <description>DPORT_DMMU_TABLE10</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE10</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE11</name>
                    <addressOffset>0x570</addressOffset>
                    <description>DPORT_DMMU_TABLE11</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE11</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE12</name>
                    <addressOffset>0x574</addressOffset>
                    <description>DPORT_DMMU_TABLE12</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE12</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE13</name>
                    <addressOffset>0x578</addressOffset>
                    <description>DPORT_DMMU_TABLE13</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE13</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE14</name>
                    <addressOffset>0x57c</addressOffset>
                    <description>DPORT_DMMU_TABLE14</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE14</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DMMU_TABLE15</name>
                    <addressOffset>0x580</addressOffset>
                    <description>DPORT_DMMU_TABLE15</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DMMU_TABLE15</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_INTRUSION_CTRL</name>
                    <addressOffset>0x584</addressOffset>
                    <description>DPORT_PRO_INTRUSION_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_INTRUSION_RECORD_RESET_N</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_INTRUSION_STATUS</name>
                    <addressOffset>0x588</addressOffset>
                    <description>DPORT_PRO_INTRUSION_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_INTRUSION_RECORD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_INTRUSION_CTRL</name>
                    <addressOffset>0x58c</addressOffset>
                    <description>DPORT_APP_INTRUSION_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_INTRUSION_RECORD_RESET_N</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_INTRUSION_STATUS</name>
                    <addressOffset>0x590</addressOffset>
                    <description>DPORT_APP_INTRUSION_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_INTRUSION_RECORD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_FRONT_END_MEM_PD</name>
                    <addressOffset>0x594</addressOffset>
                    <description>DPORT_FRONT_END_MEM_PD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PBUS_MEM_FORCE_PD</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_PBUS_MEM_FORCE_PU</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AGC_MEM_FORCE_PD</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_AGC_MEM_FORCE_PU</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_MMU_IA_INT_EN</name>
                    <addressOffset>0x598</addressOffset>
                    <description>DPORT_MMU_IA_INT_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_MMU_IA_INT_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_MPU_IA_INT_EN</name>
                    <addressOffset>0x59c</addressOffset>
                    <description>DPORT_MPU_IA_INT_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_MPU_IA_INT_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
