nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>DPORT_CACHE_IA_INT_EN</name>
                    <addressOffset>0x5a0</addressOffset>
                    <description>DPORT_CACHE_IA_INT_EN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CACHE_IA_INT_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_PRO_OPPOSITE</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_PRO_DRAM1</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_PRO_IROM0</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_PRO_IRAM1</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_PRO_IRAM0</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_PRO_DROM0</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_APP_OPPOSITE</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_APP_IROM0</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_APP_IRAM1</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_APP_IRAM0</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_CACHE_IA_INT_APP_DROM0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SECURE_BOOT_CTRL</name>
                    <addressOffset>0x5a4</addressOffset>
                    <description>DPORT_SECURE_BOOT_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SW_BOOTLOADER_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_SPI_DMA_CHAN_SEL</name>
                    <addressOffset>0x5a8</addressOffset>
                    <description>DPORT_SPI_DMA_CHAN_SEL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_SPI3_DMA_CHAN_SEL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SPI2_DMA_CHAN_SEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DPORT_SPI1_DMA_CHAN_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_VECBASE_CTRL</name>
                    <addressOffset>0x5ac</addressOffset>
                    <description>DPORT_PRO_VECBASE_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_OUT_VECBASE_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_PRO_VECBASE_SET</name>
                    <addressOffset>0x5b0</addressOffset>
                    <description>DPORT_PRO_VECBASE_SET</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_PRO_OUT_VECBASE_REG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_VECBASE_CTRL</name>
                    <addressOffset>0x5b4</addressOffset>
                    <description>DPORT_APP_VECBASE_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_OUT_VECBASE_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_APP_VECBASE_SET</name>
                    <addressOffset>0x5b8</addressOffset>
                    <description>DPORT_APP_VECBASE_SET</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_APP_OUT_VECBASE_REG</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_DATE</name>
                    <addressOffset>0xffc</addressOffset>
                    <description>DPORT_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
