nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SPI3</name>
            <baseAddress>0x3ff65000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>UART2</name>
            <baseAddress>0x3ff6e000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>TIMG</name>
            <baseAddress>0x0</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000580</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TIMG_T0CONFIG</name>
                    <addressOffset>0x0</addressOffset>
                    <description>TIMG_T0CONFIG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_INCREASE</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_AUTORELOAD</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_DIVIDER</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_EDGE_INT_EN</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_LEVEL_INT_EN</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_ALARM_EN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0LO</name>
                    <addressOffset>0x4</addressOffset>
                    <description>TIMG_T0LO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0HI</name>
                    <addressOffset>0x8</addressOffset>
                    <description>TIMG_T0HI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0UPDATE</name>
                    <addressOffset>0xc</addressOffset>
                    <description>TIMG_T0UPDATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_UPDATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0ALARMLO</name>
                    <addressOffset>0x10</addressOffset>
                    <description>TIMG_T0ALARMLO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_ALARM_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0ALARMHI</name>
                    <addressOffset>0x14</addressOffset>
                    <description>TIMG_T0ALARMHI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_ALARM_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0LOADLO</name>
                    <addressOffset>0x18</addressOffset>
                    <description>TIMG_T0LOADLO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_LOAD_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0LOADHI</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>TIMG_T0LOADHI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_LOAD_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T0LOAD</name>
                    <addressOffset>0x20</addressOffset>
                    <description>TIMG_T0LOAD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T0_LOAD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1CONFIG</name>
                    <addressOffset>0x24</addressOffset>
                    <description>TIMG_T1CONFIG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_INCREASE</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_AUTORELOAD</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_DIVIDER</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_EDGE_INT_EN</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_LEVEL_INT_EN</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_ALARM_EN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1LO</name>
                    <addressOffset>0x28</addressOffset>
                    <description>TIMG_T1LO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1HI</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>TIMG_T1HI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1UPDATE</name>
                    <addressOffset>0x30</addressOffset>
                    <description>TIMG_T1UPDATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_UPDATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1ALARMLO</name>
                    <addressOffset>0x34</addressOffset>
                    <description>TIMG_T1ALARMLO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_ALARM_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1ALARMHI</name>
                    <addressOffset>0x38</addressOffset>
                    <description>TIMG_T1ALARMHI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_ALARM_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1LOADLO</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>TIMG_T1LOADLO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_LOAD_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1LOADHI</name>
                    <addressOffset>0x40</addressOffset>
                    <description>TIMG_T1LOADHI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_LOAD_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_T1LOAD</name>
                    <addressOffset>0x44</addressOffset>
                    <description>TIMG_T1LOAD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_T1_LOAD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTCONFIG0</name>
                    <addressOffset>0x48</addressOffset>
                    <description>TIMG_WDTCONFIG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_STG0</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_STG1</name>
                            <bitOffset>27</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_STG2</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_STG3</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_EDGE_INT_EN</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_LEVEL_INT_EN</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_CPU_RESET_LENGTH</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_SYS_RESET_LENGTH</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_FLASHBOOT_MOD_EN</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTCONFIG1</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>TIMG_WDTCONFIG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_CLK_PRESCALE</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTCONFIG2</name>
                    <addressOffset>0x50</addressOffset>
                    <description>TIMG_WDTCONFIG2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_STG0_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTCONFIG3</name>
                    <addressOffset>0x54</addressOffset>
                    <description>TIMG_WDTCONFIG3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_STG1_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTCONFIG4</name>
                    <addressOffset>0x58</addressOffset>
                    <description>TIMG_WDTCONFIG4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_STG2_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTCONFIG5</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>TIMG_WDTCONFIG5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_STG3_HOLD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTFEED</name>
                    <addressOffset>0x60</addressOffset>
                    <description>TIMG_WDTFEED</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_FEED</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_WDTWPROTECT</name>
                    <addressOffset>0x64</addressOffset>
                    <description>TIMG_WDTWPROTECT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_WDT_WKEY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_RTCCALICFG</name>
                    <addressOffset>0x68</addressOffset>
                    <description>TIMG_RTCCALICFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_RTC_CALI_START</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_RTC_CALI_MAX</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_RTC_CALI_RDY</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_RTC_CALI_CLK_SEL</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_RTC_CALI_START_CYCLING</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_RTCCALICFG1</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>TIMG_RTCCALICFG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_RTC_CALI_VALUE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
