nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>TIMG_LACTCONFIG</name>
                    <addressOffset>0x70</addressOffset>
                    <description>TIMG_LACTCONFIG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_INCREASE</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_AUTORELOAD</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_DIVIDER</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_EDGE_INT_EN</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_LEVEL_INT_EN</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_ALARM_EN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_LAC_EN</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_CPST_EN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_LACT_RTC_ONLY</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTRTC</name>
                    <addressOffset>0x74</addressOffset>
                    <description>TIMG_LACTRTC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_RTC_STEP_LEN</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>26</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTLO</name>
                    <addressOffset>0x78</addressOffset>
                    <description>TIMG_LACTLO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTHI</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>TIMG_LACTHI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTUPDATE</name>
                    <addressOffset>0x80</addressOffset>
                    <description>TIMG_LACTUPDATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_UPDATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTALARMLO</name>
                    <addressOffset>0x84</addressOffset>
                    <description>TIMG_LACTALARMLO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_ALARM_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTALARMHI</name>
                    <addressOffset>0x88</addressOffset>
                    <description>TIMG_LACTALARMHI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_ALARM_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTLOADLO</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>TIMG_LACTLOADLO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_LOAD_LO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTLOADHI</name>
                    <addressOffset>0x90</addressOffset>
                    <description>TIMG_LACTLOADHI</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_LOAD_HI</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_LACTLOAD</name>
                    <addressOffset>0x94</addressOffset>
                    <description>TIMG_LACTLOAD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_LOAD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_INT_ENA_TIMERS</name>
                    <addressOffset>0x98</addressOffset>
                    <description>TIMG_INT_ENA_TIMERS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_INT_ENA</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_INT_ENA</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_INT_ENA</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_INT_ENA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_INT_RAW_TIMERS</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>TIMG_INT_RAW_TIMERS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_INT_RAW</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_INT_RAW</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_INT_RAW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_INT_RAW</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_INT_ST_TIMERS</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>TIMG_INT_ST_TIMERS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_INT_ST</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_INT_ST</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_INT_ST</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_INT_ST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_INT_CLR_TIMERS</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>TIMG_INT_CLR_TIMERS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_LACT_INT_CLR</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_WDT_INT_CLR</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T1_INT_CLR</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMG_T0_INT_CLR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMG_NTIMERS_DATE</name>
                    <addressOffset>0xf8</addressOffset>
                    <description>TIMG_NTIMERS_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_NTIMERS_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMGCLK</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>TIMGCLK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMG_CLK_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
