nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PWM3</name>
            <baseAddress>0x3ff70000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>TIMERGROUP0</name>
            <baseAddress>0x3ff5f000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>SPI_ENCRYPT</name>
            <baseAddress>0x3ff5b000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>GPIO_SD</name>
            <baseAddress>0x3ff44f00</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000160</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>GPIO_SIGMADELTA0</name>
                    <addressOffset>0x0</addressOffset>
                    <description>GPIO_SIGMADELTA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD0_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD0_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA1</name>
                    <addressOffset>0x4</addressOffset>
                    <description>GPIO_SIGMADELTA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD1_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD1_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA2</name>
                    <addressOffset>0x8</addressOffset>
                    <description>GPIO_SIGMADELTA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD2_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD2_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA3</name>
                    <addressOffset>0xc</addressOffset>
                    <description>GPIO_SIGMADELTA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD3_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD3_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA4</name>
                    <addressOffset>0x10</addressOffset>
                    <description>GPIO_SIGMADELTA4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD4_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD4_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA5</name>
                    <addressOffset>0x14</addressOffset>
                    <description>GPIO_SIGMADELTA5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD5_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD5_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA6</name>
                    <addressOffset>0x18</addressOffset>
                    <description>GPIO_SIGMADELTA6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD6_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD6_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA7</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>GPIO_SIGMADELTA7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD7_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GPIO_SD7_IN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA_CG</name>
                    <addressOffset>0x20</addressOffset>
                    <description>GPIO_SIGMADELTA_CG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD_CLK_EN</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA_MISC</name>
                    <addressOffset>0x24</addressOffset>
                    <description>GPIO_SIGMADELTA_MISC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SPI_SWAP</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMADELTA_VERSION</name>
                    <addressOffset>0x28</addressOffset>
                    <description>GPIO_SIGMADELTA_VERSION</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SD_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>28</bitWidth>
                        </field>
                    </fields>
                </register>
