nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>I2S_INT_CLR</name>
                    <addressOffset>0x18</addressOffset>
                    <description>I2S_INT_CLR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_OUT_TOTAL_EOF_INT_CLR</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_IN_DSCR_EMPTY_INT_CLR</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_OUT_DSCR_ERR_INT_CLR</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_IN_DSCR_ERR_INT_CLR</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_OUT_EOF_INT_CLR</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_OUT_DONE_INT_CLR</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_IN_ERR_EOF_INT_CLR</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_IN_SUC_EOF_INT_CLR</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_IN_DONE_INT_CLR</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_HUNG_INT_CLR</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_HUNG_INT_CLR</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_REMPTY_INT_CLR</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_WFULL_INT_CLR</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_REMPTY_INT_CLR</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_WFULL_INT_CLR</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_PUT_DATA_INT_CLR</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TAKE_DATA_INT_CLR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_TIMING</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>I2S_TIMING</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_TX_BCK_IN_INV</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_DATA_ENABLE_DELAY</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_DSYNC_SW</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_DSYNC_SW</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_BCK_OUT_DELAY</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_WS_OUT_DELAY</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_SD_OUT_DELAY</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_WS_OUT_DELAY</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_BCK_OUT_DELAY</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_SD_IN_DELAY</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_WS_IN_DELAY</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_BCK_IN_DELAY</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_WS_IN_DELAY</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_BCK_IN_DELAY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_FIFO_CONF</name>
                    <addressOffset>0x20</addressOffset>
                    <description>I2S_FIFO_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_RX_FIFO_MOD_FORCE_EN</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_FIFO_MOD_FORCE_EN</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_FIFO_MOD</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_FIFO_MOD</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>I2S_DSCR_EN</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_DATA_NUM</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_DATA_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_RXEOF_NUM</name>
                    <addressOffset>0x24</addressOffset>
                    <description>I2S_RXEOF_NUM</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_RX_EOF_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_CONF_SIGLE_DATA</name>
                    <addressOffset>0x28</addressOffset>
                    <description>I2S_CONF_SIGLE_DATA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_SIGLE_DATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_CONF_CHAN</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>I2S_CONF_CHAN</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_RX_CHAN_MOD</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_CHAN_MOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_OUT_LINK</name>
                    <addressOffset>0x30</addressOffset>
                    <description>I2S_OUT_LINK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_OUTLINK_PARK</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_OUTLINK_RESTART</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_OUTLINK_START</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_OUTLINK_STOP</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_OUTLINK_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_IN_LINK</name>
                    <addressOffset>0x34</addressOffset>
                    <description>I2S_IN_LINK</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_INLINK_PARK</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_INLINK_RESTART</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_INLINK_START</name>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_INLINK_STOP</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_INLINK_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_OUT_EOF_DES_ADDR</name>
                    <addressOffset>0x38</addressOffset>
                    <description>I2S_OUT_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_OUT_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_IN_EOF_DES_ADDR</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>I2S_IN_EOF_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_IN_SUC_EOF_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_OUT_EOF_BFR_DES_ADDR</name>
                    <addressOffset>0x40</addressOffset>
                    <description>I2S_OUT_EOF_BFR_DES_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_OUT_EOF_BFR_DES_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_AHB_TEST</name>
                    <addressOffset>0x44</addressOffset>
                    <description>I2S_AHB_TEST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_AHB_TESTADDR</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_AHB_TESTMODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_INLINK_DSCR</name>
                    <addressOffset>0x48</addressOffset>
                    <description>I2S_INLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_INLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_INLINK_DSCR_BF0</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>I2S_INLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_INLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_INLINK_DSCR_BF1</name>
                    <addressOffset>0x50</addressOffset>
                    <description>I2S_INLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_INLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_OUTLINK_DSCR</name>
                    <addressOffset>0x54</addressOffset>
                    <description>I2S_OUTLINK_DSCR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_OUTLINK_DSCR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_OUTLINK_DSCR_BF0</name>
                    <addressOffset>0x58</addressOffset>
                    <description>I2S_OUTLINK_DSCR_BF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_OUTLINK_DSCR_BF0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_OUTLINK_DSCR_BF1</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>I2S_OUTLINK_DSCR_BF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_OUTLINK_DSCR_BF1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
