nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>I2S_CLKM_CONF</name>
                    <addressOffset>0xac</addressOffset>
                    <description>I2S_CLKM_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_CLKA_ENA</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_CLK_EN</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_CLKM_DIV_A</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>I2S_CLKM_DIV_B</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>I2S_CLKM_DIV_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_SAMPLE_RATE_CONF</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>I2S_SAMPLE_RATE_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_RX_BITS_MOD</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_BITS_MOD</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_BCK_DIV_NUM</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_BCK_DIV_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_PDM_CONF</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>I2S_PDM_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_TX_PDM_HP_BYPASS</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_PDM_SINC_DSR_16_EN</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_SIGMADELTA_IN_SHIFT</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_SINC_IN_SHIFT</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_LP_IN_SHIFT</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_HP_IN_SHIFT</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_PRESCALE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_SINC_OSR2</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>I2S_PDM2PCM_CONV_EN</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_PCM2PDM_CONV_EN</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_RX_PDM_EN</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_PDM_FREQ_CONF</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>I2S_PDM_FREQ_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_TX_PDM_FP</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_PDM_FS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_STATE</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>I2S_STATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_RX_FIFO_RESET_BACK</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_FIFO_RESET_BACK</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2S_TX_IDLE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2S_DATE</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>I2S_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>I2S_I2SDATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
