nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SPI2</name>
            <baseAddress>0x3ff64000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>APB_CTRL</name>
            <baseAddress>0x3ff66000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000220</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>APB_CTRL_SYSCLK_CONF</name>
                    <addressOffset>0x0</addressOffset>
                    <description>APB_CTRL_SYSCLK_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_QUICK_CLK_CHNG</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_RST_TICK_CNT</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_CLK_EN</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_CLK_320M_EN</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_PRE_DIV_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_XTAL_TICK_CONF</name>
                    <addressOffset>0x4</addressOffset>
                    <description>APB_CTRL_XTAL_TICK_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_XTAL_TICK_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_PLL_TICK_CONF</name>
                    <addressOffset>0x8</addressOffset>
                    <description>APB_CTRL_PLL_TICK_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_PLL_TICK_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_CK8M_TICK_CONF</name>
                    <addressOffset>0xc</addressOffset>
                    <description>APB_CTRL_CK8M_TICK_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_CK8M_TICK_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_CTRL</name>
                    <addressOffset>0x10</addressOffset>
                    <description>APB_CTRL_APB_SARADC_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_DATA_TO_I2S</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_DATA_SAR_SEL</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_PATT_P_CLEAR</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR1_PATT_P_CLEAR</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_PATT_LEN</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR1_PATT_LEN</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR_CLK_DIV</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR_CLK_GATED</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR_SEL</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_WORK_MODE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_MUX</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_START</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_START_FORCE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_CTRL2</name>
                    <addressOffset>0x14</addressOffset>
                    <description>APB_CTRL_APB_SARADC_CTRL2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_INV</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_SAR1_INV</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_MAX_MEAS_NUM</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_MEAS_NUM_LIMIT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_FSM</name>
                    <addressOffset>0x18</addressOffset>
                    <description>APB_CTRL_APB_SARADC_FSM</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAMPLE_CYCLE</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_START_WAIT</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_STANDBY_WAIT</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>APB_CTRL_SARADC_RSTB_WAIT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR1_PATT_TAB1</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR1_PATT_TAB1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR1_PATT_TAB1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR1_PATT_TAB2</name>
                    <addressOffset>0x20</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR1_PATT_TAB2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR1_PATT_TAB2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR1_PATT_TAB3</name>
                    <addressOffset>0x24</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR1_PATT_TAB3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR1_PATT_TAB3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR1_PATT_TAB4</name>
                    <addressOffset>0x28</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR1_PATT_TAB4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR1_PATT_TAB4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR2_PATT_TAB1</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR2_PATT_TAB1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_PATT_TAB1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR2_PATT_TAB2</name>
                    <addressOffset>0x30</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR2_PATT_TAB2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_PATT_TAB2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR2_PATT_TAB3</name>
                    <addressOffset>0x34</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR2_PATT_TAB3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_PATT_TAB3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APB_SARADC_SAR2_PATT_TAB4</name>
                    <addressOffset>0x38</addressOffset>
                    <description>APB_CTRL_APB_SARADC_SAR2_PATT_TAB4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_SARADC_SAR2_PATT_TAB4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_APLL_TICK_CONF</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>APB_CTRL_APLL_TICK_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_APLL_TICK_NUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB_CTRL_DATE</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>APB_CTRL_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>APB_CTRL_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
