nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FE2</name>
            <baseAddress>0x3ff45000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers />
        </peripheral>
        <peripheral>
            <name>RTC_I2C</name>
            <baseAddress>0x3ff48c00</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000160</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>RTC_I2C_SCL_LOW_PERIOD</name>
                    <addressOffset>0x0</addressOffset>
                    <description>RTC_I2C_SCL_LOW_PERIOD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_SCL_LOW_PERIOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_CTRL</name>
                    <addressOffset>0x4</addressOffset>
                    <description>RTC_I2C_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_RX_LSB_FIRST</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_TX_LSB_FIRST</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_TRANS_START</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_MS_MODE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_SCL_FORCE_OUT</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_SDA_FORCE_OUT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_DEBUG_STATUS</name>
                    <addressOffset>0x8</addressOffset>
                    <description>RTC_I2C_DEBUG_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_SCL_STATE</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_MAIN_STATE</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_BYTE_TRANS</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_SLAVE_ADDR_MATCH</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_BUS_BUSY</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_ARB_LOST</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_TIMED_OUT</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_SLAVE_RW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_ACK_VAL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_TIMEOUT</name>
                    <addressOffset>0xc</addressOffset>
                    <description>RTC_I2C_TIMEOUT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_TIMEOUT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_SLAVE_ADDR</name>
                    <addressOffset>0x10</addressOffset>
                    <description>RTC_I2C_SLAVE_ADDR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_SLAVE_ADDR_10BIT</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_SLAVE_ADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_INT_RAW</name>
                    <addressOffset>0x20</addressOffset>
                    <description>RTC_I2C_INT_RAW</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_TIME_OUT_INT_RAW</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_TRANS_COMPLETE_INT_RAW</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_MASTER_TRANS_COMPLETE_INT_RAW</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_ARBITRATION_LOST_INT_RAW</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_SLAVE_TRANS_COMPLETE_INT_RAW</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_INT_CLR</name>
                    <addressOffset>0x24</addressOffset>
                    <description>RTC_I2C_INT_CLR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_TIME_OUT_INT_CLR</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_TRANS_COMPLETE_INT_CLR</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_MASTER_TRANS_COMPLETE_INT_CLR</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_ARBITRATION_LOST_INT_CLR</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_I2C_SLAVE_TRANS_COMPLETE_INT_CLR</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_SDA_DUTY</name>
                    <addressOffset>0x30</addressOffset>
                    <description>RTC_I2C_SDA_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_SDA_DUTY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_SCL_HIGH_PERIOD</name>
                    <addressOffset>0x38</addressOffset>
                    <description>RTC_I2C_SCL_HIGH_PERIOD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_SCL_HIGH_PERIOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_SCL_START_PERIOD</name>
                    <addressOffset>0x40</addressOffset>
                    <description>RTC_I2C_SCL_START_PERIOD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_SCL_START_PERIOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_I2C_SCL_STOP_PERIOD</name>
                    <addressOffset>0x44</addressOffset>
                    <description>RTC_I2C_SCL_STOP_PERIOD</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_I2C_SCL_STOP_PERIOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
