nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>UART_MEM_CONF</name>
                    <addressOffset>0x58</addressOffset>
                    <description>UART_MEM_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_TX_MEM_EMPTY_THRHD</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART_RX_MEM_FULL_THRHD</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART_XOFF_THRESHOLD_H2</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>UART_XON_THRESHOLD_H2</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>UART_RX_TOUT_THRHD_H3</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART_RX_FLOW_THRHD_H3</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART_TX_SIZE</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>UART_RX_SIZE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>UART_MEM_PD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_MEM_TX_STATUS</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>UART_MEM_TX_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_MEM_TX_STATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_MEM_RX_STATUS</name>
                    <addressOffset>0x60</addressOffset>
                    <description>UART_MEM_RX_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_MEM_RX_STATUS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                        <field>
                            <name>UART_MEM_RX_RD_ADDR</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>UART_MEM_RX_WR_ADDR</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_MEM_CNT_STATUS</name>
                    <addressOffset>0x64</addressOffset>
                    <description>UART_MEM_CNT_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_TX_MEM_CNT</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART_RX_MEM_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_POSPULSE</name>
                    <addressOffset>0x68</addressOffset>
                    <description>UART_POSPULSE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_POSEDGE_MIN_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_NEGPULSE</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>UART_NEGPULSE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_NEGEDGE_MIN_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_DATE</name>
                    <addressOffset>0x78</addressOffset>
                    <description>UART_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_ID</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>UART_ID</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UART_ID</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
