nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>LEDC_HSCH5_HPOINT</name>
                    <addressOffset>0x68</addressOffset>
                    <description>LEDC_HSCH5_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_HSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH5_DUTY</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>LEDC_HSCH5_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_HSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH5_CONF1</name>
                    <addressOffset>0x70</addressOffset>
                    <description>LEDC_HSCH5_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_HSCH5</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_HSCH5</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_HSCH5</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_HSCH5</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_HSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH5_DUTY_R</name>
                    <addressOffset>0x74</addressOffset>
                    <description>LEDC_HSCH5_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_HSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH6_CONF0</name>
                    <addressOffset>0x78</addressOffset>
                    <description>LEDC_HSCH6_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_IDLE_LV_HSCH6</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_HSCH6</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_HSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH6_HPOINT</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>LEDC_HSCH6_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_HSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH6_DUTY</name>
                    <addressOffset>0x80</addressOffset>
                    <description>LEDC_HSCH6_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_HSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH6_CONF1</name>
                    <addressOffset>0x84</addressOffset>
                    <description>LEDC_HSCH6_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_HSCH6</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_HSCH6</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_HSCH6</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_HSCH6</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_HSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH6_DUTY_R</name>
                    <addressOffset>0x88</addressOffset>
                    <description>LEDC_HSCH6_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_HSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH7_CONF0</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>LEDC_HSCH7_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_IDLE_LV_HSCH7</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_HSCH7</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_HSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH7_HPOINT</name>
                    <addressOffset>0x90</addressOffset>
                    <description>LEDC_HSCH7_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_HSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH7_DUTY</name>
                    <addressOffset>0x94</addressOffset>
                    <description>LEDC_HSCH7_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_HSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH7_CONF1</name>
                    <addressOffset>0x98</addressOffset>
                    <description>LEDC_HSCH7_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_HSCH7</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_HSCH7</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_HSCH7</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_HSCH7</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_HSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSCH7_DUTY_R</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>LEDC_HSCH7_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_HSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH0_CONF0</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>LEDC_LSCH0_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH0</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH0</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH0</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH0_HPOINT</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>LEDC_LSCH0_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH0_DUTY</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>LEDC_LSCH0_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH0_CONF1</name>
                    <addressOffset>0xac</addressOffset>
                    <description>LEDC_LSCH0_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH0</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH0</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH0</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH0</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH0_DUTY_R</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>LEDC_LSCH0_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH1_CONF0</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>LEDC_LSCH1_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH1</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH1</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH1_HPOINT</name>
                    <addressOffset>0xb8</addressOffset>
                    <description>LEDC_LSCH1_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH1_DUTY</name>
                    <addressOffset>0xbc</addressOffset>
                    <description>LEDC_LSCH1_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH1_CONF1</name>
                    <addressOffset>0xc0</addressOffset>
                    <description>LEDC_LSCH1_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH1</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH1</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH1</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH1</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH1_DUTY_R</name>
                    <addressOffset>0xc4</addressOffset>
                    <description>LEDC_LSCH1_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH1</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH2_CONF0</name>
                    <addressOffset>0xc8</addressOffset>
                    <description>LEDC_LSCH2_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH2</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH2</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH2</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH2_HPOINT</name>
                    <addressOffset>0xcc</addressOffset>
                    <description>LEDC_LSCH2_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH2_DUTY</name>
                    <addressOffset>0xd0</addressOffset>
                    <description>LEDC_LSCH2_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
