nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>LEDC_LSCH2_CONF1</name>
                    <addressOffset>0xd4</addressOffset>
                    <description>LEDC_LSCH2_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH2</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH2</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH2</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH2</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH2_DUTY_R</name>
                    <addressOffset>0xd8</addressOffset>
                    <description>LEDC_LSCH2_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH2</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH3_CONF0</name>
                    <addressOffset>0xdc</addressOffset>
                    <description>LEDC_LSCH3_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH3</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH3</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH3</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH3_HPOINT</name>
                    <addressOffset>0xe0</addressOffset>
                    <description>LEDC_LSCH3_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH3_DUTY</name>
                    <addressOffset>0xe4</addressOffset>
                    <description>LEDC_LSCH3_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH3_CONF1</name>
                    <addressOffset>0xe8</addressOffset>
                    <description>LEDC_LSCH3_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH3</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH3</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH3</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH3</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH3_DUTY_R</name>
                    <addressOffset>0xec</addressOffset>
                    <description>LEDC_LSCH3_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH3</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH4_CONF0</name>
                    <addressOffset>0xf0</addressOffset>
                    <description>LEDC_LSCH4_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH4</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH4</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH4</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH4_HPOINT</name>
                    <addressOffset>0xf4</addressOffset>
                    <description>LEDC_LSCH4_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH4_DUTY</name>
                    <addressOffset>0xf8</addressOffset>
                    <description>LEDC_LSCH4_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH4_CONF1</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>LEDC_LSCH4_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH4</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH4</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH4</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH4</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH4_DUTY_R</name>
                    <addressOffset>0x100</addressOffset>
                    <description>LEDC_LSCH4_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH5_CONF0</name>
                    <addressOffset>0x104</addressOffset>
                    <description>LEDC_LSCH5_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH5</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH5</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH5</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH5_HPOINT</name>
                    <addressOffset>0x108</addressOffset>
                    <description>LEDC_LSCH5_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH5_DUTY</name>
                    <addressOffset>0x10c</addressOffset>
                    <description>LEDC_LSCH5_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH5_CONF1</name>
                    <addressOffset>0x110</addressOffset>
                    <description>LEDC_LSCH5_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH5</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH5</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH5</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH5</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH5_DUTY_R</name>
                    <addressOffset>0x114</addressOffset>
                    <description>LEDC_LSCH5_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH5</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH6_CONF0</name>
                    <addressOffset>0x118</addressOffset>
                    <description>LEDC_LSCH6_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH6</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH6</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH6</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH6_HPOINT</name>
                    <addressOffset>0x11c</addressOffset>
                    <description>LEDC_LSCH6_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH6_DUTY</name>
                    <addressOffset>0x120</addressOffset>
                    <description>LEDC_LSCH6_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH6_CONF1</name>
                    <addressOffset>0x124</addressOffset>
                    <description>LEDC_LSCH6_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH6</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH6</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH6</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH6</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH6_DUTY_R</name>
                    <addressOffset>0x128</addressOffset>
                    <description>LEDC_LSCH6_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH6</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH7_CONF0</name>
                    <addressOffset>0x12c</addressOffset>
                    <description>LEDC_LSCH7_CONF0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_PARA_UP_LSCH7</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_IDLE_LV_LSCH7</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_SIG_OUT_EN_LSCH7</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TIMER_SEL_LSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH7_HPOINT</name>
                    <addressOffset>0x130</addressOffset>
                    <description>LEDC_LSCH7_HPOINT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HPOINT_LSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH7_DUTY</name>
                    <addressOffset>0x134</addressOffset>
                    <description>LEDC_LSCH7_DUTY</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
