nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>LEDC_LSCH7_CONF1</name>
                    <addressOffset>0x138</addressOffset>
                    <description>LEDC_LSCH7_CONF1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_START_LSCH7</name>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_INC_LSCH7</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_NUM_LSCH7</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CYCLE_LSCH7</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_SCALE_LSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSCH7_DUTY_R</name>
                    <addressOffset>0x13c</addressOffset>
                    <description>LEDC_LSCH7_DUTY_R</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_LSCH7</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER0_CONF</name>
                    <addressOffset>0x140</addressOffset>
                    <description>LEDC_HSTIMER0_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_TICK_SEL_HSTIMER0</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER0_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER0_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_HSTIMER0</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER0_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER0_VALUE</name>
                    <addressOffset>0x144</addressOffset>
                    <description>LEDC_HSTIMER0_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HSTIMER0_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER1_CONF</name>
                    <addressOffset>0x148</addressOffset>
                    <description>LEDC_HSTIMER1_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_TICK_SEL_HSTIMER1</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER1_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER1_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_HSTIMER1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER1_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER1_VALUE</name>
                    <addressOffset>0x14c</addressOffset>
                    <description>LEDC_HSTIMER1_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HSTIMER1_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER2_CONF</name>
                    <addressOffset>0x150</addressOffset>
                    <description>LEDC_HSTIMER2_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_TICK_SEL_HSTIMER2</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER2_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER2_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_HSTIMER2</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER2_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER2_VALUE</name>
                    <addressOffset>0x154</addressOffset>
                    <description>LEDC_HSTIMER2_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HSTIMER2_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER3_CONF</name>
                    <addressOffset>0x158</addressOffset>
                    <description>LEDC_HSTIMER3_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_TICK_SEL_HSTIMER3</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER3_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER3_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_HSTIMER3</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER3_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_HSTIMER3_VALUE</name>
                    <addressOffset>0x15c</addressOffset>
                    <description>LEDC_HSTIMER3_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_HSTIMER3_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER0_CONF</name>
                    <addressOffset>0x160</addressOffset>
                    <description>LEDC_LSTIMER0_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER0_PARA_UP</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TICK_SEL_LSTIMER0</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER0_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER0_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_LSTIMER0</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER0_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER0_VALUE</name>
                    <addressOffset>0x164</addressOffset>
                    <description>LEDC_LSTIMER0_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER0_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER1_CONF</name>
                    <addressOffset>0x168</addressOffset>
                    <description>LEDC_LSTIMER1_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER1_PARA_UP</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TICK_SEL_LSTIMER1</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER1_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER1_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_LSTIMER1</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER1_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER1_VALUE</name>
                    <addressOffset>0x16c</addressOffset>
                    <description>LEDC_LSTIMER1_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER1_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER2_CONF</name>
                    <addressOffset>0x170</addressOffset>
                    <description>LEDC_LSTIMER2_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER2_PARA_UP</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TICK_SEL_LSTIMER2</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER2_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER2_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_LSTIMER2</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER2_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER2_VALUE</name>
                    <addressOffset>0x174</addressOffset>
                    <description>LEDC_LSTIMER2_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER2_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER3_CONF</name>
                    <addressOffset>0x178</addressOffset>
                    <description>LEDC_LSTIMER3_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER3_PARA_UP</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_TICK_SEL_LSTIMER3</name>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER3_RST</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER3_PAUSE</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DIV_NUM_LSTIMER3</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER3_LIM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_LSTIMER3_VALUE</name>
                    <addressOffset>0x17c</addressOffset>
                    <description>LEDC_LSTIMER3_VALUE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_LSTIMER3_CNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
