nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>LEDC_INT_CLR</name>
                    <addressOffset>0x18c</addressOffset>
                    <description>LEDC_INT_CLR</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH7_INT_CLR</name>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH6_INT_CLR</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH5_INT_CLR</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH4_INT_CLR</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH3_INT_CLR</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH2_INT_CLR</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH1_INT_CLR</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_LSCH0_INT_CLR</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH7_INT_CLR</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH6_INT_CLR</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH5_INT_CLR</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH4_INT_CLR</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH3_INT_CLR</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH2_INT_CLR</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH1_INT_CLR</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_DUTY_CHNG_END_HSCH0_INT_CLR</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER3_OVF_INT_CLR</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER2_OVF_INT_CLR</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER1_OVF_INT_CLR</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_LSTIMER0_OVF_INT_CLR</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER3_OVF_INT_CLR</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER2_OVF_INT_CLR</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER1_OVF_INT_CLR</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEDC_HSTIMER0_OVF_INT_CLR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_CONF</name>
                    <addressOffset>0x190</addressOffset>
                    <description>LEDC_CONF</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_APB_CLK_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LEDC_DATE</name>
                    <addressOffset>0x1fc</addressOffset>
                    <description>LEDC_DATE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LEDC_DATE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
