nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>MCPWM</name>
            <baseAddress>0x0</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000940</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MCPWM_CLK_CFG</name>
                    <addressOffset>0x0</addressOffset>
                    <description>MCPWM_CLK_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_CLK_PRESCALE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER0_CFG0</name>
                    <addressOffset>0x4</addressOffset>
                    <description>MCPWM_TIMER0_CFG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER0_PERIOD_UPMETHOD</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_PERIOD</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_PRESCALE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER0_CFG1</name>
                    <addressOffset>0x8</addressOffset>
                    <description>MCPWM_TIMER0_CFG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER0_MOD</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_START</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER0_SYNC</name>
                    <addressOffset>0xc</addressOffset>
                    <description>MCPWM_TIMER0_SYNC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER0_PHASE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_SYNCO_SEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_SYNC_SW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_SYNCI_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER0_STATUS</name>
                    <addressOffset>0x10</addressOffset>
                    <description>MCPWM_TIMER0_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER0_DIRECTION</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_VALUE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER1_CFG0</name>
                    <addressOffset>0x14</addressOffset>
                    <description>MCPWM_TIMER1_CFG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER1_PERIOD_UPMETHOD</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_PERIOD</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_PRESCALE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER1_CFG1</name>
                    <addressOffset>0x18</addressOffset>
                    <description>MCPWM_TIMER1_CFG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER1_MOD</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_START</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER1_SYNC</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>MCPWM_TIMER1_SYNC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER1_PHASE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_SYNCO_SEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_SYNC_SW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_SYNCI_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER1_STATUS</name>
                    <addressOffset>0x20</addressOffset>
                    <description>MCPWM_TIMER1_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER1_DIRECTION</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_VALUE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER2_CFG0</name>
                    <addressOffset>0x24</addressOffset>
                    <description>MCPWM_TIMER2_CFG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER2_PERIOD_UPMETHOD</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_PERIOD</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_PRESCALE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER2_CFG1</name>
                    <addressOffset>0x28</addressOffset>
                    <description>MCPWM_TIMER2_CFG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER2_MOD</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_START</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER2_SYNC</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>MCPWM_TIMER2_SYNC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER2_PHASE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_SYNCO_SEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_SYNC_SW</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_SYNCI_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER2_STATUS</name>
                    <addressOffset>0x30</addressOffset>
                    <description>MCPWM_TIMER2_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_TIMER2_DIRECTION</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_VALUE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_TIMER_SYNCI_CFG</name>
                    <addressOffset>0x34</addressOffset>
                    <description>MCPWM_TIMER_SYNCI_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_EXTERNAL_SYNCI2_INVERT</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_EXTERNAL_SYNCI1_INVERT</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_EXTERNAL_SYNCI0_INVERT</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER2_SYNCISEL</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER1_SYNCISEL</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_TIMER0_SYNCISEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_OPERATOR_TIMERSEL</name>
                    <addressOffset>0x38</addressOffset>
                    <description>MCPWM_OPERATOR_TIMERSEL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_OPERATOR2_TIMERSEL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_OPERATOR1_TIMERSEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_OPERATOR0_TIMERSEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN0_STMP_CFG</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>MCPWM_GEN0_STMP_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN0_B_SHDW_FULL</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_A_SHDW_FULL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_B_UPMETHOD</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_A_UPMETHOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN0_TSTMP_A</name>
                    <addressOffset>0x40</addressOffset>
                    <description>MCPWM_GEN0_TSTMP_A</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN0_A</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN0_TSTMP_B</name>
                    <addressOffset>0x44</addressOffset>
                    <description>MCPWM_GEN0_TSTMP_B</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN0_B</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN0_CFG0</name>
                    <addressOffset>0x48</addressOffset>
                    <description>MCPWM_GEN0_CFG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN0_T1_SEL</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_T0_SEL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_CFG_UPMETHOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN0_FORCE</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>MCPWM_GEN0_FORCE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN0_B_NCIFORCE_MODE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_B_NCIFORCE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_A_NCIFORCE_MODE</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_A_NCIFORCE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_B_CNTUFORCE_MODE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_A_CNTUFORCE_MODE</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN0_CNTUFORCE_UPMETHOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
