nimblemachines/muforth/mu/target/ESP8266/svd/esp32/esp32.base.svd
                <register>
                    <name>MCPWM_GEN1_FORCE</name>
                    <addressOffset>0x84</addressOffset>
                    <description>MCPWM_GEN1_FORCE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN1_B_NCIFORCE_MODE</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_NCIFORCE</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_NCIFORCE_MODE</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_NCIFORCE</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_CNTUFORCE_MODE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_CNTUFORCE_MODE</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_CNTUFORCE_UPMETHOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN1_A</name>
                    <addressOffset>0x88</addressOffset>
                    <description>MCPWM_GEN1_A</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN1_A_DT1</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_DT0</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_DTEB</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_DTEA</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_DTEP</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_DTEZ</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_UT1</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_UT0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_UTEB</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_UTEA</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_UTEP</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_A_UTEZ</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN1_B</name>
                    <addressOffset>0x8c</addressOffset>
                    <description>MCPWM_GEN1_B</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN1_B_DT1</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_DT0</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_DTEB</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_DTEA</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_DTEP</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_DTEZ</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_UT1</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_UT0</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_UTEB</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_UTEA</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_UTEP</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN1_B_UTEZ</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_DT1_CFG</name>
                    <addressOffset>0x90</addressOffset>
                    <description>MCPWM_DT1_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_DT1_CLK_SEL</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_B_OUTBYPASS</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_A_OUTBYPASS</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_FED_OUTINVERT</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_RED_OUTINVERT</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_FED_INSEL</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_RED_INSEL</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_B_OUTSWAP</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_A_OUTSWAP</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_DEB_MODE</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_RED_UPMETHOD</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_DT1_FED_UPMETHOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_DT1_FED_CFG</name>
                    <addressOffset>0x94</addressOffset>
                    <description>MCPWM_DT1_FED_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_DT1_FED</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_DT1_RED_CFG</name>
                    <addressOffset>0x98</addressOffset>
                    <description>MCPWM_DT1_RED_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_DT1_RED</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_CARRIER1_CFG</name>
                    <addressOffset>0x9c</addressOffset>
                    <description>MCPWM_CARRIER1_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_CARRIER1_IN_INVERT</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_CARRIER1_OUT_INVERT</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_CARRIER1_OSHWTH</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_CARRIER1_DUTY</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_CARRIER1_PRESCALE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_CARRIER1_EN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_FH1_CFG0</name>
                    <addressOffset>0xa0</addressOffset>
                    <description>MCPWM_FH1_CFG0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_FH1_B_OST_U</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_B_OST_D</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_B_CBC_U</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_B_CBC_D</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_A_OST_U</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_A_OST_D</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_A_CBC_U</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_A_CBC_D</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_F0_OST</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_F1_OST</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_F2_OST</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_SW_OST</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_F0_CBC</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_F1_CBC</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_F2_CBC</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_SW_CBC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_FH1_CFG1</name>
                    <addressOffset>0xa4</addressOffset>
                    <description>MCPWM_FH1_CFG1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_FH1_FORCE_OST</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_FORCE_CBC</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_CBCPULSE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_CLR_OST</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_FH1_STATUS</name>
                    <addressOffset>0xa8</addressOffset>
                    <description>MCPWM_FH1_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_FH1_OST_ON</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_FH1_CBC_ON</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN2_STMP_CFG</name>
                    <addressOffset>0xac</addressOffset>
                    <description>MCPWM_GEN2_STMP_CFG</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN2_B_SHDW_FULL</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN2_A_SHDW_FULL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN2_B_UPMETHOD</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCPWM_GEN2_A_UPMETHOD</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN2_TSTMP_A</name>
                    <addressOffset>0xb0</addressOffset>
                    <description>MCPWM_GEN2_TSTMP_A</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN2_A</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCPWM_GEN2_TSTMP_B</name>
                    <addressOffset>0xb4</addressOffset>
                    <description>MCPWM_GEN2_TSTMP_B</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCPWM_GEN2_B</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
